{
    "_metadata": {
        "document": {
            "title": "Classes"
        },
        "tag": {
            "case_sensitive": false,
            "whitespace_as": "-"
        }
    },
    "_precompute#HIDDEN": {
        "_st": {
            "1": "1st",
            "2": "2nd",
            "3": "3rd",
            "4": "4th",
            "5": "5th",
            "6": "6th",
            "7": "7th",
            "8": "8th",
            "9": "9th",
            "10": "10th",
            "11": "11th",
            "12": "12th",
            "13": "13th",
            "14": "14th",
            "15": "15th",
            "16": "16th",
            "17": "17th",
            "18": "18th",
            "19": "19th",
            "20": "20th"
        }
    },
    "_compute#HIDDEN": {
        "_hitpoints": [
            "Return = []",
            "Return += [\"Hit Dice: 1d{0} per level\".format(ARG)]",
            "Return += [\"Hit Points at 1st Level: {0} + your Constitution modifier\".format(ARG)]",
            "Return += [\"Hit Points at Higher Levels: 1d{0} (or {1}) + your Constitution modifier\".format(ARG, ARG // 2 + 1)]",
            "return Return"
        ]
    },
    "Table of Contents#H4#ADD_CLASS(columns-3)": {
        "0.<LIST_START>": "",
        "1.<LIST_ITEM><GOTO:Artificer:Classes+Artificer>": [
            "<LIST_START>",
            "<LIST_ITEM>Alchemist",
            "<LIST_ITEM>Armorer",
            "<LIST_ITEM>Artillerist",
            "<LIST_ITEM>Battle Smith",
            "<LIST_STOP>"
        ],
        "2.<LIST_ITEM><GOTO:Barbarian:Classes+Barbarian>": [
            "<LIST_START>",
            "<LIST_ITEM>Path of the Ancestral Guardian",
            "<LIST_ITEM>Path of the Battlerager",
            "<LIST_ITEM>Path of the Beast",
            "<LIST_ITEM>Path of the Berserker",
            "<LIST_ITEM>Path of the Storm Herald",
            "<LIST_ITEM>Path of the Totem Warrior",
            "<LIST_ITEM>Path of Wild Magic",
            "<LIST_ITEM>Path of the Zealot",
            "<LIST_STOP>"
        ],
        "3.<LIST_ITEM><GOTO:Bard:Classes+Bard>": [
            "<LIST_START>",
            "<LIST_ITEM>College of Creation",
            "<LIST_ITEM>College of Eloquence",
            "<LIST_ITEM>College of Glamour",
            "<LIST_ITEM>College of Lore",
            "<LIST_ITEM>College of Spirits",
            "<LIST_ITEM>College of Swords",
            "<LIST_ITEM>College of Valor",
            "<LIST_ITEM>College of Whispers",
            "<LIST_STOP>"
        ],
        "4.<LIST_ITEM><GOTO:Cleric:Classes+Cleric>": [
            "<LIST_START>",
            "<LIST_ITEM>Arcana Domian",
            "<LIST_ITEM>Death Domian",
            "<LIST_ITEM>Forge Domian",
            "<LIST_ITEM>Grave Domian",
            "<LIST_ITEM>Knowledge Domian",
            "<LIST_ITEM>Life Domian",
            "<LIST_ITEM>Light Domian",
            "<LIST_ITEM>Nature Domian",
            "<LIST_ITEM>Order Domian",
            "<LIST_ITEM>Peace Domian",
            "<LIST_ITEM>Tempest Domian",
            "<LIST_ITEM>Trickery Domian",
            "<LIST_ITEM>Twilight Domian",
            "<LIST_ITEM>War Domain",
            "<LIST_STOP>"
        ],
        "5.<LIST_ITEM><GOTO:Druid:Classes+Druid>": [
            "<LIST_START>",
            "<LIST_ITEM>Circle of Dreams",
            "<LIST_ITEM>Circle of the Land",
            "<LIST_ITEM>Circle of the Moon",
            "<LIST_ITEM>Circle of the Shepherd",
            "<LIST_ITEM>Circle of Spores",
            "<LIST_ITEM>Circle of Stars",
            "<LIST_ITEM>Circle of Wildfire",
            "<LIST_STOP>"
        ],
        "6.<LIST_ITEM><GOTO:Fighter:Classes+Fighter>": [
            "<LIST_START>",
            "<LIST_ITEM>Arcane Archer",
            "<LIST_ITEM>Battle Master",
            "<LIST_ITEM>Cavalier",
            "<LIST_ITEM>Champion",
            "<LIST_ITEM>Echo Knight",
            "<LIST_ITEM>Eldritch Knight",
            "<LIST_ITEM>Psi Warrior",
            "<LIST_ITEM>Purple Dragon Knight",
            "<LIST_ITEM>Rune Knight",
            "<LIST_ITEM>Samurai",
            "<LIST_STOP>"
        ],
        "7.<LIST_ITEM><GOTO:Monk:Classes+Monk>": [
            "<LIST_START>",
            "<LIST_STOP>"
        ],
        "8.<LIST_ITEM><GOTO:Paladin:Classes+Paladin>": [
            "<LIST_START>",
            "<LIST_STOP>"
        ],
        "9.<LIST_ITEM><GOTO:Ranger:Classes+Ranger>": [
            "<LIST_START>",
            "<LIST_STOP>"
        ],
        "10.<LIST_ITEM><GOTO:Rogue:Classes+Rogue>": [
            "<LIST_START>",
            "<LIST_STOP>"
        ],
        "11.<LIST_ITEM><GOTO:Sorceror:Classes+Sorceror>": [
            "<LIST_START>",
            "<LIST_STOP>"
        ],
        "12.<LIST_ITEM><GOTO:Warlock:Classes+Warlock>": [
            "<LIST_START>",
            "<LIST_STOP>"
        ],
        "13.<LIST_ITEM><GOTO:Wizard:Classes+Wizard>": [
            "<LIST_START>",
            "<LIST_STOP>"
        ],
        "999.<LIST_STOP>": ""
    },
    "Artificer#H4": {
        "Level#HIDDEN#RANGE": [1, 20],
        "Proficiency Bonus#HIDDEN#INC": [1, 1, 5, 9, 13, 17],
        "Features#HIDDEN": [
            "Magical Tinkering, Spellcasting",
            "Infuse Item",
            "Artificer Specialist, The Right Tool for the Job",
            "Ability Score Improvement",
            "Artificer Specialist feature",
            "Tool Expertise",
            "Flash of Genius",
            "Ability Score Improvement",
            "Artificer Specialist feature",
            "Magic Item Adept",
            "Spell-Storing Item",
            "Ability Score Improvement",
            "-",
            "Magic Item Savant",
            "Artificer Specialist feature",
            "Ability Score Improvement",
            "-",
            "Magic Item Master",
            "Ability Score Improvement",
            "Soul of Artifice"
        ],
        "Infusions Known#HIDDEN#INC": [2, 2, 2, 2, 6, 6, 10, 10, 14, 14, 18, 18],
        "Infused Items#HIDDEN#INC": [2, 2, 6, 10, 14, 18],
        "Cantrips Known#HIDDEN#INC": [1, 1, 10, 14],
        "1st level spell slots#HIDDEN#INC": [1, 1, 3, 5],
        "2nd level spell slots#HIDDEN#INC": [5, 5, 7],
        "3rd level spell slots#HIDDEN#INC": [9, 9, 11],
        "4th level spell slots#HIDDEN#INC": [13, 15, 17],
        "5th level spell slots#HIDDEN#INC": [17, 19],
        "1.The Artificer#H3#HR_AFTER#HR_BEFORE#LOOKUP_TABLE(1,20)": [
            "Level", "Proficiency Bonus", "Features", "Infusions Known", "Infused Items", "Cantrips Known"
        ],

        "2.Hit Dice#H2#CALL(_hitpoints)": 8,
        "3.Proficiencies#H2": [
            "<BOLD>Armor:</BOLD>Light armor, medium armor, shields",
            "2.Weapons:Simple weapons, firearms*",
            "3.Tools:Thieves' tools, tinker's tools, one type of artisan's tools of your choice",
            "4.Saving Throws: CON and INT",
            "5.Skills (2): Arcana, History, Investigation, Medicine, Nature, Perception, Sleight of Hand "
        ],
        "4.Starting Equipment or 5d4 x 10 gp#H2": [
            "<LIST_START>",
            "<LIST_ITEM>any two simple weapons",
            "<LIST_ITEM>Light crossbow and 20 bolts",
            "<LIST_ITEM>(a) studded leather armor or (b) scale mail",
            "<LIST_ITEM>thieves' tools and dungeoneer's pack",
            "<LIST_STOP>"
        ],
        "5.Multiclassing#H2": [
            "Need INT of 13 to multiclass in or out",
            "Proficiencies gained: light armor, medium armor, shields, thieves' tools, tinker's tools",
            "Spell slots: Add half your levels (round up) in artificer to the levels from other classes to determine spell slots"
        ],


        "6.1st level#H3": {
            "1.Magical Tinkering#H2": [
                "At 1st level, you've learned how to invest a spark of magic into mundane objects. To use this ability, you must have thieves' tools or artisan's tools in hand. You then touch a Tiny nonmagical object as an action and give it one of the following magical properties of your choice:",
                "<LIST_START>",
                "<LIST_ITEM>The object sheds bright light in a 5-foot radius and dim light for an additional 5 feet.",
                "<LIST_ITEM>Whenever tapped by a creature, the object emits a recorded message that can be heard up to 10 feet away. You utter the message when you bestow this property on the object, and the recording can be no more than 6 seconds long.",
                "<LIST_ITEM>The object continuously emits your choice of an odor or a nonverbal sound (wind, waves, chirping, or the like). The chosen phenomenon is perceivable up to 10 feet away.",
                "<LIST_ITEM>A static visual effect appears on one of the object's surfaces. This effect can be a picture, up to 25 words of text, lines and shapes, or a mixture of these elements, as you like.",
                "<LIST_STOP>",
                "The chosen property lasts indefinitely. As an action, you can touch the object and end the property early.",
                "You can bestow magic on multiple objects, touching one object each time you use this feature, though a single object can only bear one property at a time. The maximum number of objects you can affect with this feature at one time is equal to your Intelligence modifier (minimum of one object). If you try to exceed your maximum, the oldest property immediately ends, and then the new property applies."
            ],
            "2.Spellcasting#H2": {
                "1.#H1": "You've studied the workings of magic and how to cast spells, channeling the magic through objects. To observers, you don't appear to be casting spells in a conventional way; you appear to produce wonders from mundane items and outlandish inventions.",
                "2.Tools Required#H1": [
                    "You produce your artificer spell effects through your tools. You must have a spellcasting focus-specifically thieves' tools or some kind of artisan's tool-in hand when you cast any spell with this Spellcasting feature (meaning the spell has an \"M\" component when you cast it). You must be proficient with the tool to use it in this way. See the equipment chapter in the Player's Handbook for descriptions of these tools.",
                    "After you gain the Infuse Item feature at 2nd level, you can also use any item bearing one of your infusions as a spellcasting focus."
                ],
                "3.Cantrips (0-Level Spells)#H1": [
                    "At 1st level, you know two cantrips of your choice from the artificer spell list. At higher levels, you learn additional artificer can trips of your choice, as shown in the Cantrips Known column of the Artificer table.",
                    "When you gain a level in this class, you can replace one of the artificer cantrips you know with another cantrip from the artificer spell list."
                ],
                "4.Preparing and Casting Spells#H1": [
                    "The Artificer table shows how many spell slots you have to cast your artificer spells. To cast one of your artificer spells of 1st level or higher, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
                    "You prepare the list of artificer spells that are available for you to cast, choosing from the artificer spell list. When you do so, choose a number of artificer spells equal to your Intelligence modifier + half your artificer level, rounded down (minimum of one spell). The spells must be of a level for which you have spell slots.",
                    "For example, if you are a 5th-level artificer, you have four 1st-level and two 2nd-level spell slots. With an Intelligence of 14, your list of prepared spells can include four spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell Cure Wounds, you can cast it using a lst-level or a 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.",
                    "You can change your list of prepared spells when you finish a long rest. Preparing a new list of artificer spells requires time spent tinkering with your spellcasting focuses: at least 1 minute per spell level for each spell on your list."
                ],
                "5.Spellcasting Ability#H1": [
                    "Intelligence is your spellcasting ability for your artificer spells; your understanding of the theory behind magic allows you to wield these spells with superior skill. You use your Intelligence whenever an artificer spell refers to your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for an artificer spell you cast and when making an attack roll with one.",
                    "<BOLD>Spell save DC</BOLD> = 8 + your proficiency bonus + your Intelligence modifier",
                    "<BOLD>Spell attack modifier</BOLD> = your proficiency bonus + your Intelligence modifier"
                ],
                "6.Ritual Casting#H1": "You can cast an artificer spell as a ritual if that spell has the ritual tag and you have the spell prepared."
            }
        },

        "7.2nd level#H3": {
            "Infuse Item#H2": {
                "1.#H1": "At 2nd level, you've gained the ability to imbue mundane items with certain magical infusions, turning those objects into magic items.",
                "2.Infusions Known#H1": [
                    "When you gain this feature, pick four artificer infusions to learn. You learn additional infusions of your choice when you reach certain levels in this class, as shown in the Infusions Known column of the Artificer table.",
                    "Whenever you gain a level in this class, you can replace one of the artificer infusions you learned with a new one."
                ],
                "3.Infusing an Item#H1": [
                    "Whenever you finish a long rest, you can touch a nonmagical object and imbue it with one of your artificer infusions, turning it into a magic item. An infusion works on only certain kinds of objects, as specified in the infusion's description. If the item requires attunement, you can attune yourself to it the instant you infuse the item. If you decide to attune to the item later, you must do so using the normal process for attunement (see the attunement rules in the Dungeon Master's Guide).",
                    "Your infusion remains in an item indefinitely, but when you die, the infusion vanishes after a number of days equal to your Intelligence modifier (minimum of 1 day). The infusion also vanishes if you replace your knowledge of the infusion.",
                    "You can infuse more than one nonmagical object at the end of a long rest; the maximum number of objects appears in the Infused Items column of the Artificer table. You must touch each of the objects, and each of your infusions can be in only one object at a time. Moreover, no object can bear more than one of your infusions at a time. If you try to exceed your maximum number of infusions, the oldest infusion ends, and then the new infusion applies.",
                    "If an infusion ends on an item that contains other things, like a bag of holding, its contents harmlessly appear in and around its space."
                ]
            }
        },

        "8.3rd level#H3": {
            "1. The Right Tool for the Job#H2": "At 3rd level, you've learned how to produce exactly the tool you need: with thieves' tools or artisan's tools in hand, you can magically create one set of artisan's tools in an unoccupied space within 5 feet of you. This creation requires 1 hour of uninterrupted work, which can coincide with a short or long rest. Though the product of magic, the tools are nonmagical, and they vanish when you use this feature again.",
            "2. Alchemist#H3": {
                "1.Tool Proficiency#H2": "When you adopt this specialization at 3rd level, you gain proficiency with alchemist's supplies. If you already have this proficiency, you gain proficiency with one other type of artisan's tools of your choice.",
                "2.Alchemist Spells#H2": {
                    "1.#H1": "Starting at 3rd level, you always have certain spells prepared after you reach particular levels in this class, as shown in the Alchemist Spells table. These spells count as artificer spells for you, but they don't count against the number of artificer spells you prepare.",
                    "2.Alchemist Spells at 3rd Level#H1": [
                        "<GOTO:Healing Word:Spells+Healing Word>",
                        "<GOTO:Ray of Sickness:Spells+Ray of Sickness>"
                    ]
                },
                "3.Experimental Elixir#H2": {
                    "1.#H1": [
                        "Beginning at 3rd level, whenever you finish a long rest, you can magically produce an <ITALIC>experimental elixir</ITALIC> in an empty flask you touch. Roll on the Experimental Elixir table for the elixir's effect, which is triggered when someone drinks the elixir. As an action, a creature can drink the elixir or administer it to an incapacitated creature.",
                        "You can create additional <ITALIC>experimental elixirs</ITALIC> by expending a spell slot of 1st level or higher for each one. When you do so, you use your action to create the elixir in an empty flask you touch, and you choose the elixir's effect from the Experimental Elixir table.",
                        "Creating an <ITALIC>experimental elixir</ITALIC> requires you to have alchemist supplies on your person, and any elixir you create with this feature lasts until it is drunk or until the end of your next long rest.",
                        "When you reach certain levels in this class, you can make more elixirs at the end of a long rest: two at 6th level and three at 15th level. Roll for each elixir's effect separately. Each elixir requires its own flask."
                    ],
                    "2.Experimental Elixir#H1#TABLE": [
                        ["1d6", "Effect"],
                        ["1", "<BOLD>Healing.</BOLD> The drinker regains a number of hit points equal to 2d4 + your Intelligence Modifier"],
                        ["2", "<BOLD>Swiftness.</BOLD> The drinker's walking speed increases by 10 feet for 1 hour."],
                        ["3", "<BOLD>Resilience.</BOLD> The drinker gains a +1 bonus to AC for 10 minutes."],
                        ["4", "<BOLD>Boldness.</BOLD> The drinker can roll a d4 and add the number rolled to every attack roll and saving throw they make for the next minute."],
                        ["5", "<BOLD>Flight.</BOLD> The drinker gains a flying speed of 10 feet for 10 minutes."],
                        ["6", "<BOLD>Transformation.</BOLD> The drinker's body is transformed as if by the <GOTO:Alter Self:Spells+Alter Self> spell. The drinker determines the transformation caused by the spell, the effects of which last for 10 minutes."]
                    ]
                }
            },
            "3. Armorer#H3": {
                "1.Tools of the Trade#H2": "When you adopt this specialization at 3rd level, you gain proficiency with heavy armor. You also gain proficiency with smith's tools. If you already have this tool proficiency, you gain proficiency with one other type of artisan's tools of your choice.",
                "2.Armorer Spells#H2": {
                    "1.#H1": "Starting at 3rd level, you always have certain spells prepared after you reach particular levels in this class, as shown in the Armorer Spells table. These spells count as artificer spells for you, but they don't count against the number of artificer spells you prepare.",
                    "2.Armorer Spells at 3rd Level#H1": [
                        "<GOTO:Magic Missile:Spells+Magic Missile>",
                        "<GOTO:Thunderwave:Spells+Thunderwave>"
                    ]
                },
                "3.Arcane Armor#H2": [
                    "Beginning at 3rd level, your metallurgical pursuits have led to you making armor a conduit for your magic. As an action, you can turn a suit of armor you are wearing into Arcane Armor, provided you have smith's tools in hand.",
                    "You gain the following benefits while wearing this armor:",
                    "<LIST_START>",
                    "<LIST_ITEM>If the armor normally has a Strength requirement, the arcane armor lacks this requirement for you.",
                    "<LIST_ITEM>You can use the arcane armor as a spellcasting focus for your artificer spells.",
                    "<LIST_ITEM>The armor attaches to you and can't be removed against your will. It also expands to cover your entire body, although you can retract or deploy the helmet as a bonus action. The armor replaces any missing limbs, functioning identically to a body part it is replacing.",
                    "<LIST_ITEM>You can doff or don the armor as an action.",
                    "<LIST_STOP>",
                    "The armor continues to be Arcane Armor until you don another suit of armor or you die."
                ],
                "4.Armor Model#H2": [
                    "Beginning at 3rd level, you can customize your Arcane Armor. When you do so, choose one of the following armor models: Guardian or Infiltrator. The model you choose gives you special benefits while you wear it.",
                    "Each model includes a special weapon. When you attack with that weapon, you can add your Intelligence modifier, instead of Strength or Dexterity, to the attack and damage rolls.",
                    "You can change the armor's model whenever you finish a short or long rest, provided you have smith's tools in hand.",
                    "<BOLD>Guardian.</BOLD> You design your armor to be in the front line of conflict. It has the following features:",
                    "<LIST_START>",
                    "<LIST_ITEM><BOLD>Thunder Gauntlets.</BOLD> Each of the armor's gauntlets counts as a simple melee weapon while you aren't holding anything in it, and it deals 1d8 thunder damage on a hit. A creature hit by the gauntlet has disadvantage on attack rolls against targets other than you until the start of your next turn, as the armor magically emits a distracting pulse when the creature attacks someone else.",
                    "<LIST_ITEM><BOLD>Defensive Field.</BOLD> As a bonus action, you can gain temporary hit points equal to your level in this class, replacing any temporary hit points you already have. You lose these temporary hit points if you doff the armor. You can use this bonus action a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.",
                    "<LIST_STOP>",
                    "<BOLD>Infiltrator.</BOLD> You customize your armor for subtle undertakings. It has the following features:",
                    "<LIST_START>",
                    "<LIST_ITEM><BOLD>Lightning Launcher.</BOLD> A gemlike node appears on one of your armored fists or on the chest (your choice). It counts as a simple ranged weapon, with a normal range of 90 feet and a long range of 300 feet, and it deals 1d6 lightning damage on a hit. Once on each of your turns when you hit a creature with it, you can deal an extra 1d6 lightning damage to that target.",
                    "<LIST_ITEM><BOLD>Powered Steps.</BOLD> Your walking speed increases by 5 feet.",
                    "<LIST_ITEM><BOLD>Dampening Field.</BOLD> You have advantage on Dexterity (Stealth) checks. If the armor normally imposes disadvantage on such checks, the advantage and disadvantage cancel each other, as normal.",
                    "<LIST_STOP>"
                ]
            },
            "4. Artillerist#H3": {
                "1.Tool Proficiency#H2": "When you adopt this specialization at 3rd level, you gain proficiency with woodcarver's tools. If you already have this proficiency, you gain proficiency with one other type of artisan's tools of your choice.",
                "2.Artillerist Spells#H2": {
                    "1.#H1": "Starting at 3rd level, you always have certain spells prepared after you reach particular levels in this class, as shown in the Artillerist Spells table. These spells count as artificer spells for you, but they don't count against the number of artificer spells you prepare.",
                    "2.Artillerist Spells at 3rd Level#H1": [
                        "<GOTO:Shield:Spells+Shield>",
                        "<GOTO:Thunderwave:Spells+Thunderwave>"
                    ]
                },
                "3.Eldritch Cannon#H2": {
                    "1.#H1": [
                        "Also at 3rd level, you've learned how to create a magical cannon. Using woodcarver's tools or smith's tools, you can take an action to magically create a Small or Tiny eldritch cannon in an unoccupied space on a horizontal surface within 5 feet of you. A Small eldritch cannon occupies its space, and a Tiny one can be held in one hand. Once you create a cannon, you can't do so again until you finish a long rest or until you expend a spell slot to create one. You can have only one cannon at a time and can't create one while your cannon is present.",
                        "The cannon is a magical object. Regardless of size, the cannon has an AC of 18 and a number of hit points equal to five times your artificer level. It is immune to poison damage and psychic damage. If it is forced to make an ability check or a saving throw, treat all its ability scores as 10 (+0). If the mending spell is cast on it, it regains 2d6 hit points. It disappears if it is reduced to 0 hit points or after 1 hour. You can dismiss it early as an action.",
                        "When you create the cannon, you determine its appearance and whether it has legs. You also decide which type it is, choosing from the options on the Eldritch Cannons table. On each of your turns, you can take a bonus action to cause the cannon to activate if you are within 60 feet of it. As part of the same bonus action, you can direct the cannon to walk or climb up to 15 feet to an unoccupied space, provided it has legs."
                    ],
                    "2.Eldritch Cannon#H1#TABLE": [
                        ["Cannon", "Activation"],
                        ["Flamethrower", "The cannon exhales fire in an adjacent 15-foot cone that you designate. Each creature in that area must make a Dexterity saving throw against your spell save DC, taking 2d8 fire damage on a failed save or half as much damage on a successful one. The fire ignites any flammable objects in the area that aren't being worn or carried."],
                        ["Force Ballista", "Make a ranged spell attack, originating from the cannon, at one creature or object within 120 feet of it. On a hit, the target takes 2d8 force damage, and if the target is a creature, it is pushed up to 5 feet away from the cannon."],
                        ["Protector", "The cannon emits a burst of positive energy that grants itself and each creature of your choice within 10 feet of it a number of temporary hit points equal to 1d8 + your Intelligence modifier (minimum of +1)."]
                    ]
                }
            },
            "5. Battle Smith#H3": {
                "1.Tool Proficiency#H2": "When you adopt this specialization at 3rd level, you gain proficiency with smith's tools. If you already have this proficiency, you gain proficiency with one other type of artisan's tools of your choice.",
                "2.Battle Smith Spells#H2": {
                    "1.#H1": "Starting at 3rd level, you always have certain spells prepared after you reach particular levels in this class, as shown in the Battle Smith Spells table. These spells count as artificer spells for you, but they don’t count against the number of artificer spells you prepare.",
                    "2.Battle Smith Spells at 3rd Level#H1": [
                        "<GOTO:Heroism:Spells+Heroism>",
                        "<GOTO:Shield:Spells+Shield>"
                    ],
                    "3.Battle Ready#H2": [
                        "When you reach 3rd level, your combat training and your experiments with magic have paid off in two ways:",
                        "<LIST_START>",
                        "<LIST_ITEM>You gain proficiency with martial weapons.",
                        "<LIST_ITEM>When you attack with a magic weapon, you can use your Intelligence modifier, instead of Strength or Dexterity modifier, for the attack and damage rolls.",
                        "<LIST_STOP>"
                    ],
                    "4.Steel Defender#H2": {
                        "1.#H1": [
                            "By 3rd level, your tinkering has borne you a faithful companion, a steel defender. It's friendly to you and your companions, and it obeys your commands. See its game statistics in the Steel Defender stat block, which uses your proficiency bonus (PB) in several places. You determine the creature's appearance and whether it has two legs or four; your choice has no effect on its game statistics.",
                            "In combat, the defender shares your initiative count, but it takes its turn immediately after yours. It can move and use its reaction on its own, but the only action it takes on its turn is the Dodge action, unless you take a bonus action on your turn to command it to take another action. That action can be one in its stat block or some other action. If you are incapacitated, the defender can take any action of its choice, not just Dodge.",
                            "If the <GOTO:Mending:Spells+Mending> spell is cast on it, it regains 2d6 hit points. If it has died within the last hour, you can use your smith's tools as an action to revive it, provided you are within 5 feet of it and you expend a spell slot of 1st level or higher. The steel defender returns to life after 1 minute with all its hit points restored.",
                            "At the end of a long rest, you can create a new steel defender if you have smith's tools with you. If you already have a defender from this feature, the first one immediately perishes. The defender also perishes if you die."
                        ],
                        "Steel Defender Stat Block#H1": "wtf"
                    }
                }
            }
        },

        "9.4th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "10.5th level#H3": {
            "2. Alchemist#H3": {
                "1.Alchemical Savant#H2": "At 5th level, you've developed masterful command of magical chemicals, enhancing the healing and damage you create through them. Whenever you cast a spell using your alchemist's supplies as the spellcasting focus, you gain a bonus to one roll of the spell. That roll must restore hit points or be a damage roll that deals acid, fire, necrotic, or poison damage, and the bonus equals your Intelligence modifier (minimum of +1).",
                "2.Alchemist Spells at 5th Level#H2": [
                    "<GOTO:Flaming Sphere:Spells+Flaming Sphere>",
                    "<GOTO:Melf's Acid Arrow:Spells+Melf's Acid Arrow>"
                ]
            },
            "3. Armorer#H3": {
                "1.Extra Attack#H2": "Starting at 5th level, you can attack twice, rather than once, whenever you take the Attack action on your turn.",
                "2.Armorer Spells at 5th Level#H2": [
                    "<GOTO:Mirror Image:Spells+Mirror Image>",
                    "<GOTO:Shatter:Spells+Shatter>"
                ]
            },
            "4. Artillerist#H3": {
                "1.Arcane Firearm#H2": [
                    "At 5th level, You know how to turn a wand, staff, or rod into an arcane firearm, a conduit for your destructive spells. When you finish a long rest, you can use woodcarver's tools to carve special sigils into a wand, staff, or rod and thereby turn it into your arcane firearm. The sigils disappear from the object if you later carve them on a different item. The sigils otherwise last indefinitely.",
                    "You can use your arcane firearm as a spellcasting focus for your artificer spells. When you cast an artificer spell through the firearm, roll a d8, and you gain a bonus to one of the spell's damage rolls equal to the number rolled."
                ],
                "2.Artillerist Spells at 5th Level#H2": [
                    "<GOTO:Scorching Ray:Spells+Scorching Ray>",
                    "<GOTO:Shatter:Spells+Shatter>"
                ]
            },
            "5. Battle Smith#H3": {
                "1.Extra Attack#H2": "Starting at 5th level, you can attack twice, rather than once, whenever you take the Attack action on your turn.",
                "2.Battle Smith Spells at 5th Level#H2": [
                    "<GOTO:Branding Smite:Spells+Branding Smite>",
                    "<GOTO:Warding Bond:Spells+Warding Bond>"
                ]
            }
        },

        "11.6th level#H3": {
            "Tool Expertise#H2": "At 6th level, your proficiency bonus is now doubled for any ability check you make that uses your proficiency with a tool."
        },

        "12.7th level#H3": {
            "Flash of Genius#H2": [
                "At 7th level, you've gained the ability to come up with solutions under pressure. When you or another creature you can see within 30 feet of you makes an ability check or a saving throw, you can use your reaction to add your Intelligence modifier to the roll.",
                "You can use this feature a number of times equal to your Intelligence modifier (minimum of once). You regain all expended uses when you finish a long rest."
            ]
        },

        "13.8th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "14.9th level#H3": {
            "2. Alchemist#H3": {
                "1.Restorative Reagents#H2": [
                    "Starting at 9th level, you can incorporate restorative reagents into some of your works:",
                    "<LIST_START>",
                    "<LIST_ITEM>Whenever a creature drinks an <ITALIC>experimental elixir</ITALIC> you created, the creature gains temporary hit points equal to 2d6 + your Intelligence modifier (minimum of 1 temporary hit point).",
                    "<LIST_ITEM>You can cast <GOTO:Lesser Restoration:Spells+Lesser Restoration> without expending a spell slot and without preparing the spell, provided you use alchemist's supplies as the spellcasting focus. You can do so a number of times equal to your Intelligence modifier (minimum of once), and you regain all expended uses when you finish a long rest.",
                    "<LIST_STOP>"
                ],
                "2.Alchemist Spells at 9th Level#H2": [
                    "<GOTO:Gaseous Form:Spells+Gaseous Form>",
                    "<GOTO:Mass Healing Word:Spells+Mass Healing Word>"
                ]
            },
            "3. Armorer#H3": {
                "1.Armor Modifications": "At 9th level, you learn how to use your artificer infusions to specially modify your Arcane Armor. That armor now counts as separate items for the purposes of your Infuse Items feature: armor (the chest piece), boots, helmet, and the armor's special weapon. Each of those items can bear one of your infusions, and the infusions transfer over if you change your armor's model with the Armor Model feature. In addition, the maximum number of items you can infuse at once increases by 2, but those extra items must be part of your Arcane Armor.",
                "2.Armorer Spells at 9th Level#H2": [
                    "<GOTO:Hypnotic Pattern:Spells+Hypnotic Pattern>",
                    "<GOTO:Lightning Bolt:Spells+Lightning Bolt>"
                ]
            },
            "4. Artillerist#H3": {
                "1.Explosive Cannon#H2": [
                    "Starting at 9th level, every eldritch cannon you create is more destructive:",
                    "<LIST_START>",
                    "<LIST_ITEM>The cannon's damage rolls all increase by 1d8.",
                    "<LIST_ITEM>As an action, you can command the cannon to detonate if you are within 60 feet of it. Doing so destroys the cannon and forces each creature within 20 feet of it to make a Dexterity saving throw against your spell save DC, taking 3d8 force damage on a failed save or half as much damage on a successful one.",
                    "<LIST_STOP>"
                ],
                "2.Artillerist Spells at 9th Level#H2": [
                    "<GOTO:Fireball:Spells+Fireball>",
                    "<GOTO:Wind Wall:Spells+Wind Wall>"
                ]
            },
            "5. Battle Smith#H3": {
                "1.Arcane Jolt#H2": [
                    "At 9th level, you've learn new ways to channel arcane energy to harm or heal. When either you hit a target with a magic weapon attack or your steel defender hits a target, you can channel magical energy through the strike to create one of the following effects:",
                    "<LIST_START>",
                    "<LIST_ITEM>The target takes an extra 2d6 force damage.",
                    "<LIST_ITEM>Choose one creature or object you can see within 30 feet of the target. Healing energy flows into the chosen recipient, restoring 2d6 hit points to it.",
                    "<LIST_STOP>",
                    "You can use this energy a number of times equal to your Intelligence modifier (minimum of once), but you can do so no more than once on a turn. You regain all expended uses when you finish a long rest."
                ],
                "2.Battle Smith Spells at 9th Level#H2": [
                    "<GOTO:Aura of Vitality:Spells+Aura of Vitality>",
                    "<GOTO:Conjure Barrage:Spells+Conjure Barrage>"
                ]
            }
        },

        "15.10th level#H3": {
            "Magic Item Adept#H2": [
                "When you reach 10th level, you achieve a profound understanding of how to use and make magic items:",
                "<LIST_START>",
                "<LIST_ITEM>You can attune to up to four magic items at once.",
                "<LIST_ITEM>If you craft a magic item with a rarity of common or uncommon, it takes you a quarter of the normal time, and it costs you half as much of the usual gold.",
                "<LIST_STOP>"
            ]
        },

        "16.11th level#H3": {
            "Spell-Storing Item#H2": [
                "At 11th level, you can now store a spell in an object. Whenever you finish a long rest, you can touch one simple or martial weapon or one item that you can use as a spellcasting focus, and you store a spell in it, choosing a lst- or 2nd-level spell from the artificer spell list that requires 1 action to cast (you needn't have it prepared).",
                "While holding the object, a creature can take an action to produce the spell's effect from it, using your spellcasting ability modifier. If the spell requires concentration, the creature must concentrate. The spell stays in the object until it's been used a number of times equal to twice your Intelligence modifier (minimum of twice) or until you use this feature again to store a spell in an object."
            ]
        },

        "17.12th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "18.13th level#H3": {
            "1.#H2": "Access to 4th level spells",
            "2.Alchemist Spells at 13th Level#H2": [
                "<GOTO:Blight:Spells+Blight>",
                "<GOTO:Death Ward:Spells+Death Ward>"
            ],
            "3.Armorer Spells at 13th Level#H2": [
                "<GOTO:Fire Shield:Spells+Fire Shield>",
                "<GOTO:Greater Invisibility:Spells+Greater Invisibility>"
            ],
            "4.Artillerist Spells at 13th Level#H2": [
                "<GOTO:Ice Storm:Spells+Ice Storm>",
                "<GOTO:Wall of Fire:Spells+Wall of Fire>"
            ],
            "5.Battle Smith Spells at 13th Level#H2": [
                "<GOTO:Aura of Purity:Spells+Aura of Purity>",
                "<GOTO:Fire Shield:Spells+Fire Shield>"
            ]
        },

        "19.14th level#H3": {
            "Magic Item Savant#H2": [
                "At 14th level, your skill with magic items deepens more:",
                "<LIST_START>",
                "<LIST_ITEM>You can attune to up to five magic items at once.",
                "<LIST_ITEM>You ignore all class, race, spell and level requirements on attuning to or using a magic item.",
                "<LIST_STOP>"
            ]
        },

        "20.15th level#H3": {
            "2. Alchemist#H3": {
                "Chemical Mastery#H2": [
                    "By 15th level, you have been exposed to so many chemicals that they pose little risk to you, and you can use them to quickly end certain ailments:",
                    "<LIST_START>",
                    "<LIST_ITEM>You gain resistance to acid damage and poison damage, and you are now immune to the poisoned condition.",
                    "<LIST_ITEM>You can cast <GOTO:Greater Restoration:Spells+Greater Restoration> and <GOTO:Heal:Spells+Heal> without expending a spell slot, without preparing the spell, and without providing the material component, provided you use alchemist's supplies as the spellcasting focus. Once you cast either spell with this feature, you can't cast that spell with it again until you finish a long rest.",
                    "<LIST_STOP>"
                ]
            },
            "3. Armorer#H3": {
                "Perfected Armor#H2": [
                    "At 15th level, your Arcane Armor gains additional benefits based on its model, as shown below.",
                    "<BOLD>Guardian.</BOLD> When a Huge or smaller creature you can see ends its turn within 30 feet of you, you can use your reaction to magically force the creature to make a Strength saving throw against your spell save DC, pulling the creature up to 30 feet toward you to an unoccupied space. If you pull the target to a space within 5 feet of you, you can make a melee weapon attack against it as part of this reaction.",
                    "You can use this reaction a number of times equal to your proficiency bonus, and you regain all expended uses of it when you finish a long rest.",
                    "<BOLD>Infiltrator.</BOLD> Any creature that takes lightning damage from your Lightning Launcher glimmers with magical light until the start of your next turn. The glimmering creature sheds dim light in a 5-foot radius, and it has disadvantage on attack rolls against you, as the light jolts it if it attacks you. In addition, the next attack roll against it has advantage, and if that attack hits, the target takes an extra 1d6 lightning damage."
                ]
            },
            "4. Artillerist#H3": {
                "Fortified Position#H2": [
                    "By 15th level, you're a master at forming well-defended emplacements using Eldritch Cannon:",
                    "<LIST_START>",
                    "<LIST_ITEM>You and your allies have half cover while within 10 feet of a cannon you create with Eldritch Cannon, as a result of a shimmering field of magical protection that the cannon emits.",
                    "<LIST_ITEM>You can now have two cannons at the same time. You can create two with the same action (but not the same spell slot), and you can activate both of them with the same bonus action. You determine whether the cannons are identical to each other or different. You can't create a third cannon while you have two.",
                    "<LIST_STOP>"
                ]
            },
            "5. Battle Smith#H3": {
                "Improved Defender#H2": [
                    "At 15th level, your Arcane Jolt and steel defender become more powerful:",
                    "<LIST_START>",
                    "<LIST_ITEM>The extra damage and the healing of your Arcane Jolt both increase to 4d6.",
                    "<LIST_ITEM>Your steel defender gains a +2 bonus to Armor Class.",
                    "<LIST_ITEM>Whenever your steel defender uses its Deflect Attack, the attacker takes force damage equal to 1d4 + your Intelligence modifier.",
                    "<LIST_STOP>"
                ]
            }
        },

        "21.16th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "22.17th level#H3": {
            "1.#H2": "Access to 5th level spells",
            "2.Alchemist Spells at 17th Level#H2": [
                "<GOTO:Cloudkill:Spells+Cloudkill>",
                "<GOTO:Raise Dead:Spells+Raise Dead>"
            ],
            "3.Armorer Spells at 17th Level#H2": [
                "<GOTO:Passwall:Spells+Passwall>",
                "<GOTO:Wall of Force:Spells+Wall of Force>"
            ],
            "4.Artillerist Spells at 17th Level#H2": [
                "<GOTO:Cone of Cold:Spells+Cone of Cold>",
                "<GOTO:Wall of Force:Spells+Wall of Force>"
            ],
            "5.Battle Smith Spells at 17th Level#H2": [
                "<GOTO:Banishing Smite:Spells+Banishing Smite>",
                "<GOTO:Mass Cure Wounds:Spells+Mass Cure Wounds>"
            ]
        },

        "23.18th level#H3": {
            "Magic Item Master#H2": "Starting at 18th level, you can attune up to six magic items at once."
        },

        "24.19th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "25.20th level#H3": {
            "Soul of Artifice#H2": [
                "At 20th level, you develop a mystical connection to your magic items, which you can draw on for protection:",
                "<LIST_START>",
                "<LIST_ITEM>You gain a +1 bonus to all saving throws per magic item you are currently attuned to.",
                "<LIST_ITEM>If you're reduced to 0 hit points but not killed out-right, you can use your reaction to end one of your artificer infusions, causing you to drop to 1 hit point instead of 0.",
                "<LIST_STOP>"
            ]
        }
    },
    "Barbarian#H4": {
        "Level#HIDDEN#RANGE": [1, 20],
        "Proficiency Bonus#HIDDEN#INC": [1, 1, 5, 9, 13, 17],
        "Features#HIDDEN": [
            "Rage, Unarmored Defense",
            "Reckless Attack, Danger Sense",
            "Primal Knowledge (Optional), Primal Path",
            "Ability Score Improvement",
            "Extra Attack, Fast Movement",
            "Path feature",
            "Feral Instinct, Instinctive Pounce (Optional)",
            "Ability Score Improvement",
            "Brutal Critical (1 die)",
            "Primal Knowledge improvement(Optional), Path feature",
            "Relentless Rage",
            "Ability Score Improvement",
            "Brutal Critical (2 dice)",
            "Path feature",
            "Persistent Rage",
            "Ability Score Improvement",
            "Brutal Critical (3 dice)",
            "Indomitable Might",
            "Ability Score Improvement",
            "Primal Champion"
        ],
        "Rages#HIDDEN#INC": [1, 1, 3, 6, 12, 17, "20=Unlimited"],
        "Rage Damage#HIDDEN#INC#APPEND_BEFORE(+)": [1, 1, 9, 16],
        "1.The Barbarian#H3#HR_AFTER#HR_BEFORE#LOOKUP_TABLE(1,20)": [
            "Level", "Proficiency Bonus", "Features", "Rages", "Rage Damage"
        ],

        "2.Hit Dice#H2#CALL(_hitpoints)": 12,
        "3.Proficiencies#H2": [
            "<BOLD>Armor:</BOLD> Light armor, medium armor, shields",
            "<BOLD>Weapons:</BOLD> Simple weapons, martial weapons",
            "<BOLD>Tools:</BOLD> None",
            "<BOLD>Saving Throws:</BOLD> STR and CON",
            "<BOLD>Skills:</BOLD> Choose two from Animal Handling, Athletics, Intimidation, Nature, Perception, Survival"
        ],
        "4.Starting Equipment or 2d4 x 10 gp#H2": [
            "<LIST_START>",
            "<LIST_ITEM>(a) a greataxe or (b) any martial melee weapon",
            "<LIST_ITEM>(a) two handaxes or (b) any simple weapon",
            "<LIST_ITEM>An explorer's pack and four javelins",
            "<LIST_STOP>"
        ],
        "5.Multiclassing#H2": [
            "Need STR of 13 to multiclass in or out",
            "Proficiencies gained: Shields, simple weapons, martial weapons"
        ],


        "6.1st level#H3": {
            "1.Rage#H2": [
                "Enter as a bonus action.",
                "Amount of rages per level shown on Barbarian table",
                "While raging:",
                "<LIST_START>",
                "<LIST_ITEM>Advantage of STR checks and STR saving throws",
                "<LIST_ITEM>Bonus damage with melee weapon attacks",
                "<LIST_ITEM>Resistance to bludgeoning, piercing and slashing damage",
                "<LIST_STOP>",
                "You cannot concentrate on spells while raging",
                "Rage lasts for 1 minute. It ends early if you are knocked unconscious, haven't attacked a hostile creature since your last turn, or taken damage since then. You can end your rage early as a bonus action."
            ],

            "2.Unarmored Defense#H2": "AC is 10 + DEX + CON while you are not wearing armor. You can use a shield and still get this benefit."
        },

        "7.2nd level#H3": {
            "1.Reckless Attack#H2": "You can choose to have advantage on melee weapon attack rolls using strength during this turn, but attack rolls against you have advantage until your next turn.",

            "2.Danger Sense#H2": "Advantage on DEX saving throws against effects that you can see. You cannot be blinded, deafened, or incapacitated."
        },

        "8.3rd level#H3": {
            "0.Primal Knowledge (Optional)#H2": "When you reach 3rd level and again at 10th level, you gain proficiency in one skill of your choice from the list of skills available to barbarians at 1st level.",
            "1.Ancestral Guardian#H3": {
                "Ancestral Protectors#H2": "Starting when you choose this path at 3rd level, spectral warriors appear when you enter your rage. While you're raging, the first creature you hit with an attack on your turn becomes the target of the warriors, which hinder its attacks. Until the start of your next turn, that target has disadvantage on any attack roll that isn't against you, and when the target hits a creature other than you with an attack, that creature has resistance to the damage of the target's attacks."
            },
            "2.Battlerager#H3": {
                "1.Restriction: Dwarves Only#H2": ["Only dwarves can follow the Path of the Battlerager. The battlerager fills a particular niche in dwarven society and culture.",
                    "Your DM can lift this restriction to better suit the campaign. The restriction exists for the Forgotten Realms. It might not apply to your DM's setting or your DM's version of the Realms."
                ],
                "2.Battlerager Armor#H2": ["When you choose this path at 3rd level, you gain the ability to use spiked armor (AC=14+DEX(max 2), Stealth Disadvantage, 45 lb., 75 gp) as a weapon.",
                    "While you are wearing spiked armor and are raging, you can use a bonus action to make one melee weapon attack with your armor spikes against a target within 5 feet of you. If the attack hits, the spikes deal 1d4 piercing damage. You use your Strength modifier for the attack and damage rolls.",
                    "Additionally, when you use the Attack action to grapple a creature, the target takes 3 piercing damage if your grapple check succeeds."
                ]

            },
            "3.Beast#H3": {
                "1d4#HIDDEN#RANGE": [1, 4],
                "Origin#HIDDEN": ["One of your parents is a lycanthrope, and you've inherited some of their curse.",
                    "You are descended from an archdruid and inherited the ability to partially change shape.",
                    "A fey spirit gifted you with the ability to adopt different bestial aspects.",
                    "An ancient animal spirit dwells within you, allowing you to walk this path."
                ],
                "1.Origin of the Beast#H2#LOOKUP_TABLE(1,4)": [
                    "1d4", "Origin"
                ],
                "2.Form of the Beast#H2": ["Starting when you choose this path at 3rd level, when you enter your rage, you can transform, revealing the bestial power within you. Until the rage ends, you manifest a natural weapon. It counts as a simple melee weapon for you, and you add your Strength modifier to the attack and damage rolls when you attack with it, as normal.",
                    "You choose the weapon's form each time you rage:",
                    "Bite. Your mouth transforms into a bestial muzzle or great mandibles (your choice). It deals 1d8 piercing damage on a hit. Once on each of your turns when you damage a creature with this bite, you regain a number of hit points equal to your proficiency bonus, provided you have less than half your hit points when you hit.",
                    "Claws. Each of your hands transforms into a claw, which you can use as a weapon if it's empty. It deals 1d6 slashing damage on a hit. Once on each of your turns when you attack with a claw using the Attack action, you can make one additional claw attack as part of the same action.",
                    "Tail. You grow a lashing, spiny tail, which deals 1d8 piercing damage on a hit and has the reach property. If a creature you can see within 10 feet of you hits you with an attack roll, you can use your reaction to swipe your tail and roll a d8, applying a bonus to your AC equal to the number rolled, potentially causing the attack to miss you."
                ]
            },
            "4.Berserker#H3": {
                "Frenzy#H2": "Starting when you choose this path at 3rd level, you can go into a frenzy when you rage. If you do so, for the duration of your rage you can make a single melee weapon attack as a bonus action on each of your turns after this one. When your rage ends, you suffer one level of exhaustion."
            },
            "5.Storm Herald#H3": {
                "Storm Aura#H2": ["When you select this path at 3rd level, you emanate a stormy, magical aura while you rage. The aura extends 10 feet from you in every direction, but not through total cover.",
                    "Your aura has an effect that activates when you enter your rage, and you can activate the effect again on each of your turns as a bonus action. Choose desert, sea, or tundra. Your aura's effect depends on that chosen environment, as detailed below. You can change your environment choice whenever you gain a level in this class.",
                    "If your aura's effects require a saving throw, the DC equals 8 + your proficiency bonus + your Constitution modifier.",
                    "Desert. When this effect is activated, all other creatures in your aura take 2 fire damage each. The damage increases when you reach certain levels in this class, increasing to 3 at 5th level, 4 at 10th level, 5 at 15th level, and 6 at 20th level.",
                    "Sea. When this effect is activated, you can choose one other creature you can see in your aura. The target must make a Dexterity saving throw. The target takes 1d6 lightning damage on a failed save, or half as much damage on a successful one. The damage increases when you reach certain levels in this class, increasing to 2d6 at 10th level, 3d6 at 15th level, and 4d6 at 20th level.",
                    "Tundra. When this effect is activated, each creature of your choice in your aura gains 2 temporary hit points, as icy spirits inure it to suffering. The temporary hit points increase when you reach certain levels in this class, increasing to 3 at 5th level, 4 at 10th level, 5 at 15th level, and 6 at 20th level."
                ]
            },
            "6.Totem Warrior#H3": {
                "1.Spirit Seeker#H2": "Yours is a path that seeks attunement with the natural world, giving you a kinship with beasts. At 3rd level when you adopt this path, you gain the ability to cast the <GOTO:Beast Sense:Spells+Beast Sense> and <GOTO:Speak with Animals:Spells+Speak with Animals> spells, but only as rituals.",
                "2.Totem Spirit#H2": ["At 3rd level, when you adopt this path, you choose a totem spirit and gain its feature. You must make or acquire a physical totem object - an amulet or similar adornment - that incorporates fur or feathers, claws, teeth, or bones of the totem animal. At your option, you also gain minor physical attributes that are reminiscent of your totem spirit. For example, if you have a bear totem spirit, you might be unusually hairy and thick-skinned, or if your totem is the eagle, your eyes turn bright yellow.",
                    "Your totem animal might be an animal related to those listed here but more appropriate to your homeland. For example, you could choose a hawk or vulture in place of an eagle.",
                    "Bear. While raging, you have resistance to all damage except psychic damage. The spirit of the bear makes you tough enough to stand up to any punishment.",
                    "Eagle. While you're raging and aren't wearing heavy armor, other creatures have disadvantage on opportunity attack rolls against you, and you can use the Dash action as a bonus action on your turn. The spirit of the eagle makes you into a predator who can weave through the fray with ease.",
                    "Elk. While you're raging and aren't wearing heavy armor, your walking speed increases by 15 feet. The spirit of the elk makes you extraordinarily swift.",
                    "Tiger. While raging, you can add 10 feet to your long jump distance and 3 feet to your high jump distance. The spirit of the tiger empowers your leaps.",
                    "Wolf. While you're raging, your friends have advantage on melee attack rolls against any creature within 5 feet of you that is hostile to you. The spirit of the wolf makes you a leader of hunters."
                ]
            },
            "7.Wild Magic#H3": {
                "1.Magic Awareness#H2": ["When you choose this path at 3rd level, as an action, you can open your awareness to the presence of concentrated magic. Until the end of your next turn, you know the location of any spell or magic item within 60 feet of you that isn't behind total cover. When you sense a spell, you learn which school of magic it belongs to.",
                    "You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
                ],
                "2.Wild Surge#H2": ["Also at 3rd level, the magical energy roiling inside you sometimes erupts from you. When you enter your rage, roll on the Wild Magic table to determine the magical effect produced.",
                    "If the effect requires a saving throw, the DC equals 8 + your proficiency bonus + your Constitution modifier."
                ],

                "1d8#HIDDEN#RANGE": [1, 8],
                "Effect#HIDDEN": [
                    "Each creature of your choice that you can see within 30 feet of you must succeed on a Constitution saving throw or take 1d12 necrotic damage. You also gain temporary hit points equal to 1d12 plus your barbarian level.",
                    "You teleport up to 30 feet to an unoccupied space you can see. Until your rage ends, you can use this effect again on each of your turns as a bonus action.",
                    "An intangible spirit, which looks like a flumph or a pixie (your choice), appears within 5 feet of one creature of your choice that you can see within 30 feet of you. At the end of the current turn, the spirit explodes, and each creature within 5 feet of it must succeed on a Dexterity saving throw or take 1d6 force damage. Until your rage ends, you can use this effect again, summoning another spirit, on each of your turns as a bonus action.",
                    "Magic infuses one weapon of your choice that you are holding. Until your rage ends, the weapon's damage type changes to force, and it gains the light and thrown properties, with a normal range of 20 feet and a long range of 60 feet. If the weapon leaves your hand, the weapon reappears in your hand at the end of the current turn.",
                    "Whenever a creature hits you with an attack roll before your rage ends, that creature takes 1d6 force damage, as magic lashes out in retribution.",
                    "Until your rage ends, you are surrounded by multicolored, protective lights; you gain a +1 bonus to AC, and while within 10 feet of you, your allies gain the same bonus.",
                    "Flowers and vines temporarily grow around you; until your rage ends, the ground within 15 feet of you is difficult terrain for your enemies.",
                    "A bolt of light shoots from your chest. Another creature of your choice that you can see within 30 feet of you must succeed on a Constitution saving throw or take 1d6 radiant damage and be blinded until the start of your next turn. Until your rage ends, you can use this effect again on each of your turns as a bonus action."
                ],

                "3.Wild Surge Table#H2#LOOKUP_TABLE(1,8)": ["1d8", "Effect"]
            },
            "8.Zealot#H3": {
                "1.Divine Fury#H2": "Starting when you choose this path at 3rd level, you can channel divine fury into your weapon strikes. While you're raging, the first creature you hit on each of your turns with a weapon attack takes extra damage equal to 1d6 + half your Barbarian level. The extra damage is necrotic or radiant; you choose the type of damage when you gain this feature.",
                "2.Warrior of the Gods#H2": "At 3rd level, your soul is marked for endless battle. If a spell, such as <GOTO:Raise Dead:Spells+Raise Dead>, has the sole effect of restoring you to life (but not undeath), the caster doesn't need material components to cast the spell on you."
            }
        },

        "9.4th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "10.5th level#H3": {
            "1.Extra Attack#H2": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
            "2.Fast Movement#H2": "Starting at 5th level, your speed increases by 10 feet while you aren't wearing heavy armor."
        },

        "11.6th level#H3": {
            "1.Ancestral Guardian#H3": {
                "Spirit Shield#H2": ["Beginning at 6th level, the guardian spirits that aid you can provide supernatural protection to those you defend. If you are raging and a creature you can see within 30 feet of you takes damage, you can use your reaction to reduce that damage by 2d6.",
                    "When you reach certain levels in this class, you can reduce the damage by more: by 3d6 at 10th level and by 4d6 at 14th level."
                ]
            },
            "2.Battlerager#H3": {
                "Reckless Abandon#H2": "Beginning at 6th level, when you use Reckless Attack while raging, you also gain temporary hit points equal to your Constitution modifier (minimum of 1). They vanish if any of them are left when your rage ends."
            },
            "3.Beast#H3": {
                "Bestial Soul#H2": ["Beginning at 6th level, the feral power within you increases, causing the natural weapons of your Form of the Beast to count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.",
                    "You can also alter your form to help you adapt to your surroundings. When you finish a short or long rest, choose one of the following benefits, which lasts until you finish a short or long rest:",
                    "<LIST_START>",
                    "<LIST_ITEM>You gain a swimming speed equal to your walking speed, and you can breathe underwater.",
                    "<LIST_ITEM>You gain a climbing speed equal to your walking speed, and you can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check.",
                    "<LIST_ITEM>When you jump, you can make a Strength (Athletics) check and extend your jump by a number of feet equal to the check's total. You can make this special check only once per turn.",
                    "<LIST_STOP>"
                ]
            },
            "4.Berserker#H3": {
                "Mindless Rage#H2": "Beginning at 6th level, you can't be charmed or frightened while raging. If you are charmed or frightened when you enter your rage, the effect is suspended for the duration of the rage."
            },
            "5.Storm Herald#H3": {
                "Storm Soul#H2": ["At 6th level, the storm grants you benefits even when your aura isn't active. The benefits are based on the environment you chose for your Storm Aura.",
                    "Desert. You gain resistance to fire damage, and you don't suffer the effects of extreme heat, as described in the Dungeon Master's Guide. Moreover, as an action, you can touch a flammable object that isn't being worn or carried by anyone else and set it on fire.",
                    "Sea. You gain resistance to lightning damage, and you can breathe underwater. You also gain a swimming speed of 30 feet.",
                    "Tundra. You gain resistance to cold damage, and you don't suffer the effects of extreme cold, as described in the Dungeon Master's Guide. Moreover, as an action, you can touch water and turn a 5-foot cube of it into ice, which melts after 1 minute. This action fails if a creature is in the cube."
                ]
            },
            "6.Totem Warrior#H3": {
                "Aspect of the Beast#H2": ["At 6th level, you gain a magical benefit based on the totem animal of your choice. You can choose the same animal you selected at 3rd level or a different one.",
                    "Bear. You gain the might of a bear. Your carrying capacity (including maximum load and maximum lift) is doubled, and you have advantage on Strength checks made to push, pull, lift, or break objects.",
                    "Eagle. You gain the eyesight of an eagle. You can see up to 1 mile away with no difficulty, able to discern even fine details as though looking at something no more than 100 feet away from you. Additionally, dim light doesn't impose disadvantage on your Wisdom (Perception) checks.",
                    "Elk. Whether mounted or on foot, your travel pace is doubled, as is the travel pace of up to ten companions while they're within 60 feet of you and you're not incapacitated. The elk spirit helps you roam far and fast.",
                    "Tiger. You gain proficiency in two skills from the following list: Athletics, Acrobatics, Stealth, and Survival. The cat spirit hones your survival instincts.",
                    "Wolf. You gain the hunting sensibilities of a wolf. You can track other creatures while traveling at a fast pace, and you can move stealthily while traveling at a normal pace."
                ]
            },
            "7.Wild Magic#H3": {
                "Bolstering Magic#H2": ["Beginning at 6th level, you can harness your wild magic to bolster yourself or a companion. As an action, you can touch one creature (which can be yourself) and confer one of the following benefits of your choice to that creature:",
                    "<LIST_ITEM>For 10 minutes, the creature can roll a d3 whenever making an attack roll or an ability check and add the number rolled to the d20 roll.",
                    "<LIST_ITEM>Roll a d3. The creature regains one expended spell slot, the level of which equals the number rolled or lower (the creature's choice). Once a creature receives this benefit, that creature can,t receive it again until after a long rest.",
                    "You can take this action a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
                ]
            },
            "8.Zealot#H3": {
                "Fanatical Focus#H2": "Starting at 6th level, the divine power that fuels your rage can protect you. If you fail a saving throw while raging, you can reroll it, and you must use the new roll. You can use this ability only once per rage."
            }
        },

        "12.7th level#H3": {
            "1.Feral Instinct#H2": [
                "By 7th level, your instincts are so honed that you have advantage on initiative rolls.",
                "Additionally, if you are surprised at the beginning of combat and aren't incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn."
            ],
            "2.Instinctive Pounce (Optional)#H2": "At 7th level, as part of the bonus action you take to enter your rage, you can move up to half your speed."
        },

        "13.8th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "14.9th level#H3": {
            "Brutal Critical (1 die)#H2": "Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack."
        },

        "15.10th level#H3": {
            "0.Primal Knowledge improvement (Optional)#H2": "When you reach 10th level, you gain proficiency in one skill of your choice from the list of skills available to barbarians at 1st level.",
            "1.Ancestral Guardian#H3": {
                "Consult the Spirits#H2": ["At 10th level, you gain the ability to consult with your ancestral spirits. When you do so, you cast the Augury or Clairvoyance spell, without using a spell slot or material components. Rather than creating a spherical sensor, this use of Clairvoyance invisibly summons one of your ancestral spirits to the chosen location. Wisdom is your spellcasting ability for these spells.",
                    "After you cast either spell in this way, you can,t use this feature again until you finish a short or long rest."
                ]
            },
            "2.Battlerager#H3": {
                "Battlerager Charge#H2": "Beginning at 10th level, you can take the Dash action as a bonus action while you are raging."
            },
            "3.Beast#H3": {
                "Infectious Fury#H2": ["At 10th level, when you hit a creature with your natural weapons while you are raging, the beast within you can curse your target with rabid fury. The target must succeed on a Wisdom saving throw (DC equal to 8 + your Constitution modifier + your proficiency bonus) or suffer one of the following effects (your choice):",
                    "<LIST_START>",
                    "<LIST_ITEM>The target must use its reaction to make a melee attack against another creature of your choice that you can see.",
                    "<LIST_ITEM>Target takes 2d12 psychic damage.",
                    "<LIST_STOP>",
                    "You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
                ]
            },
            "4.Berserker#H3": {
                "Intimidating Presence#H2": ["Beginning at 10th level, you can use your action to frighten someone with your menacing presence. When you do so, choose one creature that you can see within 30 feet of you. If the creature can see or hear you, it must succeed on a Wisdom saving throw (DC equal to 8 + your proficiency bonus + your Charisma modifier) or be frightened of you until the end of your next turn. On subsequent turns, you can use your action to extend the duration of this effect on the frightened creature until the end of your next turn. This effect ends if the creature ends its turn out of line of sight or more than 60 feet away from you.",
                    "If the creature succeeds on its saving throw, you can't use this feature on that creature again for 24 hours."
                ]
            },
            "5.Storm Herald#H3": {
                "Shielding Storm#H2": "At 10th level, you learn to use your mastery of the storm to protect others. Each creature of your choice has the damage resistance you gained from the Storm Soul feature while the creature is in your Storm Aura."
            },
            "6.Totem Warrior#H3": {
                "Spirit Walker#H2": "At 10th level, you can cast the <GOTO:Commune with Nature:Spells+Commune with Nature> spell, but only as a ritual. When you do so, a spiritual version of one of the animals you chose for Totem Spirit or Aspect of the Beast appears to you to convey the information you seek."
            },
            "7.Wild Magic#H3": {
                "Unstable Backlash#H2": "At 10th level, when you are imperiled during your rage, the magic within you can lash out; immediately after you take damage or fail a saving throw while raging, you can use your reaction to roll on the Wild Magic table and immediately produce the effect rolled. This effect replaces your current Wild Magic effect."
            },
            "8.Zealot#H3": {
                "Zealous Presence#H2": [
                    "At 10th level, you learn to channel divine power to inspire zealotry in others. As a bonus action, you unleash a battle cry infused with divine energy. Up to ten other creatures of your choice within 60 feet of you that can hear you gain advantage on attack rolls and saving throws until the start of your next turn.",
                    "Once you use this feature, you can,t use it again until you finish a long rest."
                ]
            }
        },

        "16.11th level#H3": {
            "Relentless Rage#H2": [
                "Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you're raging and don't die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead.",
                "Each time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10."
            ]
        },

        "17.12th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "18.13th level#H3": {
            "Brutal Critical (2 dice)#H2": "Beginning at 13th level, you can roll two additional weapon damage dice when determining the extra damage for a critical hit with a melee attack."
        },

        "19.14th level#H3": {
            "1.Ancestral Guardian#H3": {
                "Vengeful Ancestors#H2": "At 14th level, your ancestral spirits grow powerful enough to retaliate. When you use your Spirit Shield to reduce the damage of an attack, the attacker takes an amount of force damage that your Spirit Shield prevents."
            },
            "2.Battlerager#H3": {
                "Spiked Retribution#H2": "Starting at 14th level, when a creature within 5 feet of you hits you with a melee attack, the attacker takes 3 piercing damage if you are raging, aren't incapacitated, and are wearing spiked armor."
            },
            "3.Beast#H3": {
                "Call the Hunt#H2": ["At 14th level, the beast within you grows so powerful that you can spread its ferocity to others and gain resilience from them joining your hunt. When you enter your rage, you can choose a number of other willing creatures you can see within 30 feet of you equal to your Constitution modifier (minimum of one creature). You gain 5 temporary hit points for each creature that accepts this feature. Until the rage ends, the chosen creatures can use the following benefit once on each of their turns: when the creature hits a target with an attack roll and deals damage to it, the creature can roll a d6 and gain a bonus to the damage equal to the number rolled.",
                    "You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
                ]
            },
            "4.Berserker#H3": {
                "Retaliation#H2": "Starting at 14th level, when you take damage from a creature that is within 5 feet of you, you can use your reaction to make a melee weapon attack against that creature."
            },
            "5.Storm Herald#H3": {
                "Raging Storm#H2": ["At 14th level, the power of the storm you channel grows mightier, lashing out at your foes. The effect is based on the environment you chose for your Storm Aura.",
                    "Desert. Immediately after a creature in your aura hits you with an attack, you can use your reaction to force that creature to make a Dexterity saving throw. On a failed save, the creature takes fire damage equal to your Barbarian level.",
                    "Sea. When you hit a creature in your aura with an attack, you can use your reaction to force that creature to make a Strength saving throw. On a failed save, the creature is knocked prone, as if struck by a wave.",
                    "Tundra. Whenever the effect of your Storm Aura is activated, you can choose one creature you can see in the aura. That creature must succeed on a Strength saving throw, or its speed is reduced to 0 until the start of your next turn, as magical frost covers it."
                ]
            },
            "6.Totem Warrior#H3": {
                "Totemic Attunement#H2": ["At 14th level, you gain a magical benefit based on a totem animal of your choice. You can choose the same animal you selected previously or a different one.",
                    "Bear. While you're raging, any creature within 5 feet of you that's hostile to you has disadvantage on attack rolls against targets other than you or another character with this feature. An enemy is immune to this effect if it can't see or hear you or if it can't be frightened.",
                    "Eagle. While raging, you have a flying speed equal to your current walking speed. This benefit works only in short bursts; you fall if you end your turn in the air and nothing else is holding you aloft.",
                    "Elk. While raging, you can use a bonus action during your move to pass through the space of a Large or smaller creature. That creature must succeed on a Strength saving throw (DC 8 + your Strength bonus + your proficiency bonus) or be knocked prone and take bludgeoning damage equal to 1d12 + your Strength modifier.",
                    "Tiger. While you're raging, if you move at least 20 feet in a straight line toward a Large or smaller target right before making a melee weapon attack against it, you can use a bonus action to make an additional melee weapon attack against it.",
                    "Wolf. While you're raging, you can use a bonus action on your turn to knock a Large or smaller creature prone when you hit it with melee weapon attack."
                ]
            },
            "7.Wild Magic#H3": {
                "Controlled Surge#H2": "At 14th level, whenever you roll on the Wild Magic table, you can roll the die twice and choose which of the two effects to unleash. If you roll the same number on both dice, you can ignore the number and choose any effect on the table."
            },
            "8.Zealot#H3": {
                "Rage Beyond Death#H2": [
                    "Beginning at 14th level, the divine power that fuels your rage allows you to shrug off fatal blows.",
                    "While you're raging, having 0 hit points doesn,t knock you unconscious. You still must make death saving throws, and you suffer the normal effects of taking damage while at 0 hit points. However, if you would die due to failing death saving throws, you don't die until your rage ends, and you die then only if you still have 0 hit points."
                ]
            }
        },

        "20.15th level#H3": {
            "Persistent Rage#H2": "Beginning at 15th level, your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it."
        },

        "21.16th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "22.17th level#H3": {
            "Brutal Critical (3 dice)#H2": "Beginning at 13th level, you can roll three additional weapon damage dice when determining the extra damage for a critical hit with a melee attack."
        },

        "23.18th level#H3": {
            "Indomitable Might#H2": "Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total."
        },

        "24.19th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "25.20th level#H3": {
            "Primal Champion#H2": "At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24."
        }
    },
    "Bard#H4": {
        "Level#HIDDEN#RANGE": [1, 20],
        "Proficiency Bonus#HIDDEN#INC": [1, 1, 5, 9, 13, 17],
        "Features#HIDDEN": [
            "Spellcasting, Bardic Inspiration (d6)",
            "Jack of All Trades, Song of Rest (d6)",
            "Bard College, Expertise",
            "Ability Score Improvement",
            "Bardic Inspiration (d8), Font of Inspiration",
            "Countercharm, Bard College Feature",
            "-",
            "Ability Score Improvement",
            "Song of Rest (d8)",
            "Bardic Inspiration (d10), Expertise, Magical Secrets",
            "-",
            "Ability Score Improvement",
            "Song of Rest (d10)",
            "Magical Secrets, Bard College Feature",
            "Bardic Inspiration (d12)",
            "Ability Score Improvement",
            "Song of Rest (d12)",
            "Magical Secrets",
            "Ability Score Improvement",
            "Superior Inspiration"
        ],
        "Cantrips Known#HIDDEN#INC": [1, 1, 5, 10],
        "Spells Known#HIDDEN#INC": [1, 1, 1, 12, 3, 4, 5, 6, 7, 8, 9, 10, 10, 11, 13, 14, 14, 15, 17, 18, 18],
        "1st level spell slots#HIDDEN#INC": [1, 1, 2, 3],
        "2nd level spell slots#HIDDEN#INC": [3, 4, 4],
        "3rd level spell slots#HIDDEN#INC": [5, 5, 6],
        "4th level spell slots#HIDDEN#INC": [7, 8, 9],
        "5th level spell slots#HIDDEN#INC": [9, 10, 18],
        "6th level spell slots#HIDDEN#INC": [11, 19],
        "7th level spell slots#HIDDEN#INC": [13, 20],
        "8th level spell slots#HIDDEN#INC": [15],
        "9th level spell slots#HIDDEN#INC": [17],
        "1.The Bard#H3#HR_AFTER#HR_BEFORE#LOOKUP_TABLE(1,20)": [
            "Level", "Proficiency Bonus", "Features", "Cantrips Known", "Spells Known"
        ],

        "2.Hit Dice#H2#CALL(_hitpoints)": 8,
        "3.Proficiencies#H2": [
            "<BOLD>Armor:</BOLD> Light armor",
            "<BOLD>Weapons:</BOLD> Simple weapons, hand crossbows, longswords, rapiers, shortswords",
            "<BOLD>Tools:</BOLD> Three musical instruments of your choice",
            "<BOLD>Saving Throws:</BOLD> DEX and CHA",
            "5.Skills: Any three"
        ],
        "4.Starting Equipment or 5d4 x 10 gp#H2": [
            "<LIST_START>",
            "<LIST_ITEM>(a) a rapier, or (b) a longsword, or (c) any simple weapon",
            "<LIST_ITEM>(a) a diplomat's pack or (b) an entertainer's pack",
            "<LIST_ITEM>(a) a lute or (b) any other musical instrument",
            "<LIST_ITEM> Leather armor and a dagger",
            "<LIST_STOP>"
        ],
        "5.Multiclassing#H2": [
            "Need CHA of 13 to multiclass in or out",
            "Proficiencies gained: Light armor, one skill, one musical instrument",
            "Spell slots: Add your levels in bard to the levels from other classes to determine spell slots"
        ],


        "6.1st level#H3": {},

        "7.2nd level#H3": {},

        "8.3rd level#H3": {},

        "9.4th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "10.5th level#H3": {},

        "11.6th level#H3": {},

        "12.7th level#H3": {},

        "13.8th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "14.9th level#H3": {},

        "15.10th level#H3": {},

        "16.11th level#H3": {},

        "17.12th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "18.13th level#H3": {},

        "19.14th level#H3": {},

        "20.15th level#H3": {},

        "21.16th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "22.17th level#H3": {},

        "23.18th level#H3": {},

        "24.19th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "25.20th level#H3": {}
    },
    "Cleric#H4": {
        "Level#HIDDEN#RANGE": [1, 20],
        "Proficiency Bonus#HIDDEN#INC": [1, 1, 5, 9, 13, 17],
        "Features#HIDDEN": [
            "Spellcasting, Divine Domain",
            "Channel Divinity (1/rest), Divine Domain feature",
            "-",
            "Ability Score Improvement",
            "Destroy Undead (CR 1/2)",
            "Channel Divinity (2/rest), Divine Domain feature",
            "-",
            "Ability Score Improvement, Destroy Undead (CR 1), Divine Domain feature",
            "-",
            "Divine Intervention",
            "Destroy Undead (CR 2)",
            "Ability Score Improvement",
            "-",
            "Destroy Undead (CR 3)",
            "-",
            "Ability Score Improvement",
            "Destroy Undead (CR 4), Divine Domain feature",
            "Channel Divinity (3/rest)",
            "Ability Score Improvement",
            "Divine Intervention improvement"
        ],
        "Cantrips Known#HIDDEN#INC": [1, 1, 1, 4, 10],
        "1st level spell slots#HIDDEN#INC": [1, 1, 2, 3],
        "2nd level spell slots#HIDDEN#INC": [3, 4, 4],
        "3rd level spell slots#HIDDEN#INC": [5, 5, 6],
        "4th level spell slots#HIDDEN#INC": [7, 8, 9],
        "5th level spell slots#HIDDEN#INC": [9, 10, 18],
        "6th level spell slots#HIDDEN#INC": [11, 19],
        "7th level spell slots#HIDDEN#INC": [13, 20],
        "8th level spell slots#HIDDEN#INC": [15],
        "9th level spell slots#HIDDEN#INC": [17],
        "1.The Cleric#H3#HR_AFTER#HR_BEFORE#LOOKUP_TABLE(1,20)": [
            "Level", "Proficiency Bonus", "Features", "Cantrips Known"
        ],

        "2.Hit Dice#H2#CALL(_hitpoints)": 8,
        "3.Proficiencies#H2": [
            "<BOLD>Armor:</BOLD> Light armor, medium armor, shields",
            "<BOLD>Weapons:</BOLD> Simple weapons",
            "<BOLD>Tools:</BOLD> None",
            "<BOLD>Saving Throws:</BOLD> WIS and CHA",
            "<BOLD>Skills:</BOLD> Choose two from History, Insight, Medicine, Persuasion, Religion "
        ],
        "4.Starting Equipment or 2d4 x 10 gp#H2": [
            "<LIST_START>",
            "<LIST_ITEM>(a) a mace or (b) a warhammer (if proficient)",
            "<LIST_ITEM>(a) scale mail, (b) leather armor, or (c) chain mail (if proficient)",
            "<LIST_ITEM>(a) a light crossbow and 20 bolts or (b) any simple weapon",
            "<LIST_ITEM>(a) a priest's pack or (b) an explorer's pack",
            "<LIST_ITEM>A shield and a holy symbol",
            "<LIST_STOP>"
        ],
        "5.Multiclassing#H2": [
            "Need WIS of 13 to multiclass in or out",
            "Proficiencies gained: Light armor, medium armor, shields",
            "Spell slots:Add your levels in cleric to the levels from other classes to determine spell slots"
        ],


        "6.1st level#H3": {},

        "7.2nd level#H3": {},

        "8.3rd level#H3": {},

        "9.4th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "10.5th level#H3": {},

        "11.6th level#H3": {},

        "12.7th level#H3": {},

        "13.8th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "14.9th level#H3": {},

        "15.10th level#H3": {},

        "16.11th level#H3": {},

        "17.12th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "18.13th level#H3": {},

        "19.14th level#H3": {},

        "20.15th level#H3": {},

        "21.16th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "22.17th level#H3": {},

        "23.18th level#H3": {},

        "24.19th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "25.20th level#H3": {}
    },
    "Druid#H4": {
        "Level#HIDDEN#RANGE": [1, 20],
        "Proficiency Bonus#HIDDEN#INC": [1, 1, 5, 9, 13, 17],
        "Features#HIDDEN": [
            "Druidic, Spellcasting",
            "Wild Shape, Druid Circle",
            "-",
            "Wild Shape improvement, Ability Score Improvement",
            "-",
            "Druid Circle feature",
            "-",
            "Wild Shape improvement, Ability Score Improvement",
            "-",
            "Druid Circle feature",
            "-",
            "Ability Score Improvement",
            "-",
            "Druid Circle feature",
            "-",
            "Ability Score Improvement",
            "-",
            "Timeless Body, Beast Spells",
            "Ability Score Improvement",
            "Archdruid"
        ],
        "Cantrips Known#HIDDEN#INC": [1, 1, 4, 10],
        "1st level spell slots#HIDDEN#INC": [1, 1, 2, 3],
        "2nd level spell slots#HIDDEN#INC": [3, 4, 4],
        "3rd level spell slots#HIDDEN#INC": [5, 5, 6],
        "4th level spell slots#HIDDEN#INC": [7, 8, 9],
        "5th level spell slots#HIDDEN#INC": [9, 10, 18],
        "6th level spell slots#HIDDEN#INC": [11, 19],
        "7th level spell slots#HIDDEN#INC": [13, 20],
        "8th level spell slots#HIDDEN#INC": [15],
        "9th level spell slots#HIDDEN#INC": [17],
        "1.The Druid#H3#HR_AFTER#HR_BEFORE#LOOKUP_TABLE(1,20)": [
            "Level", "Proficiency Bonus", "Features", "Cantrips Known"
        ],

        "2.Hit Dice#H2#CALL(_hitpoints)": 8,
        "3.Proficiencies#H2": [
            "<BOLD>Armor:</BOLD> Light armor, medium armor, shields (druids will not use armor or shields made of metal)",
            "<BOLD>Weapons:</BOLD> Clubs, daggers, darts, javelins, maces, quarterstaffs, scimitars, sickles, slings, spears",
            "<BOLD>Tools:</BOLD> Herbalism kit",
            "<BOLD>Saving Throws:</BOLD> INT and WIS",
            "<BOLD>Skills:</BOLD> Choose two from Arcana, Animal Handling, Insight, Medicine, Nature, Perception, Religion, Survival"
        ],
        "4.Starting Equipment or 2d4 x 10 gp#H2": [
            "<LIST_START>",
            "<LIST_ITEM>(a) a wooden shield or (b) any simple weapon",
            "<LIST_ITEM>(a) a scimitar or (b) any simple melee weapon",
            "<LIST_ITEM>Leather armor, an explorer's pack, and a druidic focus",
            "<LIST_STOP>"
        ],
        "5.Multiclassing#H2": [
            "Need WIS of 13 to multiclass in or out",
            "Proficiencies gained: Light armor, medium armor, shields (druids will not use armor or shields made of metal)",
            "Spell slots:Add your levels in druid to the levels from other classes to determine spell slots"
        ],


        "6.1st level#H3": {},

        "7.2nd level#H3": {},

        "8.3rd level#H3": {},

        "9.4th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "10.5th level#H3": {},

        "11.6th level#H3": {},

        "12.7th level#H3": {},

        "13.8th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "14.9th level#H3": {},

        "15.10th level#H3": {},

        "16.11th level#H3": {},

        "17.12th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "18.13th level#H3": {},

        "19.14th level#H3": {},

        "20.15th level#H3": {},

        "21.16th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "22.17th level#H3": {},

        "23.18th level#H3": {},

        "24.19th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "25.20th level#H3": {}
    },
    "Fighter#H4": {
        "Level#HIDDEN#RANGE": [1, 20],
        "Proficiency Bonus#HIDDEN#INC": [1, 1, 5, 9, 13, 17],
        "Features#HIDDEN": [
            "Fighting Style, Second Wind",
            "Action Surge (one use)",
            "Martial Archetype",
            "Ability Score Improvement",
            "Extra Attack",
            "Ability Score Improvement",
            "Martial Archetype feature",
            "Ability Score Improvement",
            "Indomitable (one use)",
            "Martial Archetype feature",
            "Extra Attack (2)",
            "Ability Score Improvement",
            "Indomitable (two uses)",
            "Ability Score Improvement",
            "Martial Archetype feature",
            "Ability Score Improvement",
            "Action Surge (two uses), Indomitable (three uses)",
            "Martial Archetype feature",
            "Ability Score Improvement",
            "Extra Attack (3)"
        ],
        "1.The Fighter#H3#HR_AFTER#HR_BEFORE#LOOKUP_TABLE(1,20)": [
            "Level", "Proficiency Bonus", "Features"
        ],

        "2.Hit Dice#H2#CALL(_hitpoints)": 10,
        "3.Proficiencies#H2": [
            "<BOLD>Armor:</BOLD> All armor, shields",
            "<BOLD>Weapons:</BOLD> Simple weapons, martial weapons",
            "<BOLD>Tools:</BOLD> None",
            "<BOLD>Saving Throws:</BOLD> STR and CON",
            "<BOLD>Skills:</BOLD> Choose two from Acrobatics, Animal Handling, Athletics, History, Insight, Intimidation, Perception, Survival "
        ],
        "4.Starting Equipment or 2d4 x 10 gp#H2": [
            "<LIST_START>",
            "<LIST_ITEM>(a) chain mail or (b) leather armor, longbow, and 20 arrows",
            "<LIST_ITEM>(a) a martial weapon and a shield or (b) two martial weapons",
            "<LIST_ITEM>(a) a light crossbow and 20 bolts or (b) two handaxes",
            "<LIST_ITEM>(a) a dungeoneer's pack or (b) an explorer's pack",
            "<LIST_STOP>"
        ],
        "5.Multiclassing#H2": [
            "Need STR or DEX of 13 to multiclass in or out",
            "Proficiencies gained: Light armor, medium armor, shields, simple weapons, martial weapons",
            "Spell slots:Add one third your levels (round down) if you have the Eldritch Knight feature to the levels from other classes to determine spell slots"
        ],


        "6.1st level#H3": {},

        "7.2nd level#H3": {},

        "8.3rd level#H3": {},

        "9.4th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "10.5th level#H3": {},

        "11.6th level#H3": {},

        "12.7th level#H3": {},

        "13.8th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "14.9th level#H3": {},

        "15.10th level#H3": {},

        "16.11th level#H3": {},

        "17.12th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "18.13th level#H3": {},

        "19.14th level#H3": {},

        "20.15th level#H3": {},

        "21.16th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "22.17th level#H3": {},

        "23.18th level#H3": {},

        "24.19th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "25.20th level#H3": {}
    },
    "Monk#H4": {
        "Level#HIDDEN#RANGE": [1, 20],
        "Proficiency Bonus#HIDDEN#INC": [1, 1, 5, 9, 13, 17],
        "Martial Arts#HIDDEN#INC#APPEND_BEFORE(1d)": [1, 1, 1, 1, 5, 5, 11, 11, 17, 17],
        "Ki Points#HIDDEN#INC": [2, 3, 4, 5, 67, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
        "Unarmored Movement#HIDDEN": ["-", "+10 ft", "+10 ft", "+10 ft", "+10 ft", "+15 ft", "+15 ft", "+15 ft", "+15 ft", "+20 ft", "+20 ft", "+20 ft", "+20 ft", "+25 ft", "+25 ft", "+25 ft", "+25 ft", "+30 ft", "+30 ft", "+30 ft"],
        "Features#HIDDEN": [
            "Unarmored Defense, Martial Arts",
            "Ki, Unarmored Movement",
            "Monastic Tradition, Deflect Missiles",
            "Ability Score Improvement",
            "Extra Attack, Stunning Strike",
            "Ki-Empowered Strikes, Monastic Tradition Feature",
            "Evasion, Stillness of Mind",
            "Ability Score Improvement",
            "Unarmored Movement improvment",
            "Purity of Body",
            "Monastic Tradition feature",
            "Ability Score Improvement",
            "Tongue of the Sun and Moon",
            "Diamond Soul",
            "Timeless Body",
            "Ability Score Improvement",
            "Monastic Tradition feature",
            "Empty Body",
            "Ability Score Improvement",
            "Perfect Self"
        ],
        "1.The Monk#H3#HR_AFTER#HR_BEFORE#LOOKUP_TABLE(1,20)": [
            "Level", "Proficiency Bonus", "Martial Arts", "Ki Points", "Unarmored Movement", "Features"
        ],

        "2.Hit Dice#H2#CALL(_hitpoints)": 8,
        "3.Proficiencies#H2": [
            "<BOLD>Armor:</BOLD> None",
            "<BOLD>Weapons:</BOLD> Simple weapons, shortswords",
            "<BOLD>Tools:</BOLD> Artisan's tools or a musical instrument",
            "<BOLD>Saving Throws:</BOLD> STR and DEX",
            "<BOLD>Skills:</BOLD> Choose two from Acrobatics, Athletics, History, Insight, Religion, Stealth"
        ],
        "4.Starting Equipment or 5d4 gp#H2": [
            "<LIST_START>",
            "<LIST_ITEM>(a) a shortsword or (b) any simple weapon",
            "<LIST_ITEM>(a) a dungeoneer's pack or (b) an explorer's pack",
            "<LIST_ITEM>10 darts",
            "<LIST_STOP>"
        ],
        "5.Multiclassing#H2": [
            "Need DEX and WIS of 13 to multiclass in or out",
            "Proficiencies gained: Simple weapons, shortswords"
        ],

        "6.1st level#H3": {},

        "7.2nd level#H3": {},

        "8.3rd level#H3": {},

        "9.4th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "10.5th level#H3": {},

        "11.6th level#H3": {},

        "12.7th level#H3": {},

        "13.8th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "14.9th level#H3": {},

        "15.10th level#H3": {},

        "16.11th level#H3": {},

        "17.12th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "18.13th level#H3": {},

        "19.14th level#H3": {},

        "20.15th level#H3": {},

        "21.16th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "22.17th level#H3": {},

        "23.18th level#H3": {},

        "24.19th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "25.20th level#H3": {}
    },
    "Paladin#H4": {
        "Level#HIDDEN#RANGE": [1, 20],
        "Proficiency Bonus#HIDDEN#INC": [1, 1, 5, 9, 13, 17],
        "Features#HIDDEN": [
            "Divine Sense, Lay on Hands",
            "Fighting Style, Spellcasting, Divine Smite",
            "Divine Health, Sacred Oath",
            "Ability Score Improvement",
            "Extra Attack",
            "Aura of Protection",
            "Sacred Oath feature",
            "Ability Score Improvement",
            "-",
            "Aura of Courage",
            "Improved Divine Smite",
            "Ability Score Improvement",
            "-",
            "Cleansing Touch",
            "Sacred Oath feature",
            "Ability Score Improvement",
            "-",
            "Aura Improvements",
            "Ability Score Improvement",
            "Sacred Oath feature"
        ],
        "1st level spell slots#HIDDEN#INC": [1, 1, 3, 5],
        "2nd level spell slots#HIDDEN#INC": [5, 5, 7],
        "3rd level spell slots#HIDDEN#INC": [9, 9, 11],
        "4th level spell slots#HIDDEN#INC": [13, 15, 17],
        "5th level spell slots#HIDDEN#INC": [17, 19],
        "1.The Paladin#H3#HR_AFTER#HR_BEFORE#LOOKUP_TABLE(1,20)": [
            "Level", "Proficiency Bonus", "Features"
        ],

        "2.Hit Dice#H2#CALL(_hitpoints)": 10,
        "3.Proficiencies#H2": [
            "<BOLD>Armor:</BOLD> All armor, shields",
            "<BOLD>Weapons:</BOLD> Simple weapons, martial weapons",
            "<BOLD>Tools:</BOLD> None",
            "<BOLD>Saving Throws:</BOLD> WIS and CHA",
            "<BOLD>Skills:</BOLD> Choose two from Athletics, Insight, Intimidation, Medicine, Persuasion, Religion"
        ],
        "4.Starting Equipment or 5d4 x 10 gp#H2": [
            "<LIST_START>",
            "<LIST_ITEM>(a) a martial weapon and a shield or (b) two martial weapons",
            "<LIST_ITEM>(a) five javelins or (b) any simple melee weapon",
            "<LIST_ITEM>(a) a priest's pack or (b) an explorer's pack",
            "<LIST_ITEM>Chain mail and a holy symbol",
            "<LIST_STOP>"
        ],
        "5.Multiclassing#H2": [
            "Need STR and CHA of 13 to multiclass in or out",
            "Proficiencies gained: Light armor, medium armor, shields, simple weapons, martial weapons",
            "Spell slots: Add half your levels (round down) in paladin to the levels from other classes to determine spell slots"
        ],

        "6.1st level#H3": {},

        "7.2nd level#H3": {},

        "8.3rd level#H3": {},

        "9.4th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "10.5th level#H3": {},

        "11.6th level#H3": {},

        "12.7th level#H3": {},

        "13.8th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "14.9th level#H3": {},

        "15.10th level#H3": {},

        "16.11th level#H3": {},

        "17.12th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "18.13th level#H3": {},

        "19.14th level#H3": {},

        "20.15th level#H3": {},

        "21.16th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "22.17th level#H3": {},

        "23.18th level#H3": {},

        "24.19th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "25.20th level#H3": {}
    },
    "Ranger#H4": {
        "Level#HIDDEN#RANGE": [1, 20],
        "Proficiency Bonus#HIDDEN#INC": [1, 1, 5, 9, 13, 17],
        "Features#HIDDEN": [
            "Favored Enemy, Natural Explorer",
            "Fighting Style, Spellcasting",
            "Ranger Archetype, Primeval Awareness",
            "Ability Score Improvement",
            "Extra Attack",
            "Favored Enemy and Natural Explorer improvements",
            "Ranger Archetype feature",
            "Ability Score Improvement",
            "-",
            "Natural Explorer improvement, Hide in Plain Sight",
            "Ranger Archetype feature",
            "Ability Score Improvement",
            "-",
            "Favored Enemy improvement, Vanish",
            "Ranger Archetype feature",
            "Ability Score Improvement",
            "-",
            "Feral Senses",
            "Ability Score Improvement",
            "Foe Slayer"
        ],
        "1st level spell slots#HIDDEN#INC": [1, 1, 3, 5],
        "2nd level spell slots#HIDDEN#INC": [5, 5, 7],
        "3rd level spell slots#HIDDEN#INC": [9, 9, 11],
        "4th level spell slots#HIDDEN#INC": [13, 15, 17],
        "5th level spell slots#HIDDEN#INC": [17, 19],
        "1.The Ranger#H3#HR_AFTER#HR_BEFORE#LOOKUP_TABLE(1,20)": [
            "Level", "Proficiency Bonus", "Features"
        ],

        "2.Hit Dice#H2#CALL(_hitpoints)": 10,
        "3.Proficiencies#H2": [
            "<BOLD>Armor:</BOLD> Light armor, medium armor, shields",
            "<BOLD>Weapons:</BOLD> Simple weapons, martial weapons",
            "<BOLD>Tools:</BOLD> None",
            "<BOLD>Saving Throws:</BOLD> STR and DEX",
            "<BOLD>Skills:</BOLD> Choose three from Animal Handling, Athletics, Insight, Investigation, Nature, Perception, Stealth, Survival"
        ],
        "4.Starting Equipment or 2d4 x 10 gp#H2": [
            "<LIST_START>",
            "<LIST_ITEM>(a) scale mail or (b) leather armor",
            "<LIST_ITEM>(a) two shortswords or (b) two simple melee weapons",
            "<LIST_ITEM>(a) a dungeoneer's pack or (b) an explorer's pack",
            "<LIST_ITEM>A longbow and a quiver of 20 arrows",
            "<LIST_STOP>"
        ],
        "5.Multiclassing#H2": [
            "Need DEX and WIS of 13 to multiclass in or out",
            "Proficiencies gained: Light armor, medium armor, shields, simple weapons, martial weapons, one skill from the class list",
            "Spell slots: Add half your levels (round down) in ranger to the levels from other classes to determine spell slots"
        ],

        "6.1st level#H3": {},

        "7.2nd level#H3": {},

        "8.3rd level#H3": {},

        "9.4th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "10.5th level#H3": {},

        "11.6th level#H3": {},

        "12.7th level#H3": {},

        "13.8th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "14.9th level#H3": {},

        "15.10th level#H3": {},

        "16.11th level#H3": {},

        "17.12th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "18.13th level#H3": {},

        "19.14th level#H3": {},

        "20.15th level#H3": {},

        "21.16th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "22.17th level#H3": {},

        "23.18th level#H3": {},

        "24.19th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "25.20th level#H3": {}
    },
    "Rogue#H4": {
        "Level#HIDDEN#RANGE": [1, 20],
        "Proficiency Bonus#HIDDEN#INC": [1, 1, 5, 9, 13, 17],
        "Features#HIDDEN": [
            "Expertise, Sneak Attack, Thieves' Cant",
            "Cunning Action",
            "Roguish Archetype",
            "Ability Score Improvement",
            "Uncanny Dodge",
            "Expertise",
            "Evasion",
            "Ability Score Improvement",
            "Roguish Archetype feature",
            "Ability Score Improvement",
            "Reliable Talent",
            "Ability Score Improvement",
            "Roguish Archetype feature",
            "Blindsense",
            "Slippery Mind",
            "Ability Score Improvement",
            "Roguish Archetype feature",
            "Elusive",
            "Ability Score Improvement",
            "Stroke of Luck"
        ],
        "1.The Rogue#H3#HR_AFTER#HR_BEFORE#LOOKUP_TABLE(1,20)": [
            "Level", "Proficiency Bonus", "Features"
        ],

        "2.Hit Dice#H2#CALL(_hitpoints)": 8,
        "3.Proficiencies#H2": [
            "<BOLD>Armor:</BOLD> Light armor",
            "<BOLD>Weapons:</BOLD> Simple weapons, hand crossbows, longswords, rapiers, shortswords",
            "<BOLD>Tools:</BOLD> Thieves' tools",
            "<BOLD>Saving Throws:</BOLD> DEX and INT",
            "<BOLD>Skills:</BOLD> Choose four from Acrobatics, Athletics, Deception, Insight, Intimidation, Investigation, Perception, Performance, Persuasion, Sleight of Hand, Stealth"
        ],
        "4.Starting Equipment or 4d4 x 10 gp#H2": [
            "<LIST_START>",
            "<LIST_ITEM>(a) a rapier or (b) a shortsword",
            "<LIST_ITEM>(a) a shortbow and quiver of 20 arrows or (b) a shortsword",
            "<LIST_ITEM>(a) a burglar's pack, (b) a dungeoneer's pack, or (c) an explorer's pack",
            "<LIST_ITEM>Leather armor, two daggers, and thieves' tools",
            "<LIST_STOP>"
        ],
        "5.Multiclassing#H2": [
            "Need DEX of 13 to multiclass in or out",
            "Proficiencies gained: Light armor, one skill from the class's skill list, thieves' tools",
            "Spell slots: Add a third your levels (round down) if you have the Arcane Trickster feature to the levels from other classes to determine spell slots"
        ],

        "6.1st level#H3": {},

        "7.2nd level#H3": {},

        "8.3rd level#H3": {},

        "9.4th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "10.5th level#H3": {},

        "11.6th level#H3": {},

        "12.7th level#H3": {},

        "13.8th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "14.9th level#H3": {},

        "15.10th level#H3": {},

        "16.11th level#H3": {},

        "17.12th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "18.13th level#H3": {},

        "19.14th level#H3": {},

        "20.15th level#H3": {},

        "21.16th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "22.17th level#H3": {},

        "23.18th level#H3": {},

        "24.19th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "25.20th level#H3": {}
    },
    "Sorceror#H4": {
        "Level#HIDDEN#RANGE": [1, 20],
        "Proficiency Bonus#HIDDEN#INC": [1, 1, 5, 9, 13, 17],
        "Sorcery Points#HIDDEN#INC": [2, 2, 3, 4, 5, 67, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
        "Features#HIDDEN": [
            "Spellcasting, Sorcerous Origin",
            "Font of Magic",
            "Metamagic",
            "Ability Score Improvement",
            "-",
            "Sorcerous Origin feature",
            "-",
            "Ability Score Improvement",
            "-",
            "Metamagic",
            "-",
            "Ability Score Improvement",
            "-",
            "Sorcerous Origin feature",
            "-",
            "Ability Score Improvement",
            "Metamagic",
            "Sorcerous Origin feature",
            "Ability Score Improvement",
            "Sorcerous Restoration"
        ],
        "Cantrips Known#HIDDEN#INC": [1, 1, 1, 1, 4, 10],
        "Spells Known#HIDDEN#INC": [1, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 13, 15, 17],
        "1st level spell slots#HIDDEN#INC": [1, 1, 2, 3],
        "2nd level spell slots#HIDDEN#INC": [3, 4, 4],
        "3rd level spell slots#HIDDEN#INC": [5, 5, 6],
        "4th level spell slots#HIDDEN#INC": [7, 8, 9],
        "5th level spell slots#HIDDEN#INC": [9, 10, 18],
        "6th level spell slots#HIDDEN#INC": [11, 19],
        "7th level spell slots#HIDDEN#INC": [13, 20],
        "8th level spell slots#HIDDEN#INC": [15],
        "9th level spell slots#HIDDEN#INC": [17],
        "1.The Sorceror#H3#HR_AFTER#HR_BEFORE#LOOKUP_TABLE(1,20)": [
            "Level", "Proficiency Bonus", "Sorcery Points", "Features", "Cantrips Known", "Spells Known"
        ],

        "2.Hit Dice#H2#CALL(_hitpoints)": 6,
        "3.Proficiencies#H2": [
            "<BOLD>Armor:</BOLD> None",
            "<BOLD>Weapons:</BOLD> Daggers, darts, slings, quarterstaffs, light crossbows",
            "<BOLD>Tools:</BOLD> None",
            "<BOLD>Saving Throws:</BOLD> CON and CHA",
            "<BOLD>Skills:</BOLD> Choose two from Arcana, Deception, Insight, Intimidation, Persuasion, Religion"
        ],
        "4.Starting Equipment or 3d4 x 10 gp#H2": [
            "<LIST_START>",
            "<LIST_ITEM>(a) a light crossbow and 20 bolts or (b) any simple weapon",
            "<LIST_ITEM>(a) a component pouch or (b) an arcane focus",
            "<LIST_ITEM>(a) a dungeoneer's pack or (b) an explorer's pack",
            "<LIST_ITEM>Two daggers",
            "<LIST_STOP>"
        ],
        "5.Multiclassing#H2": [
            "Need CHA of 13 to multiclass in or out",
            "Proficiencies gained: None",
            "Spell slots: Add your levels in sorceror to the levels from other classes to determine spell slots"
        ],

        "6.1st level#H3": {},

        "7.2nd level#H3": {},

        "8.3rd level#H3": {},

        "9.4th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "10.5th level#H3": {},

        "11.6th level#H3": {},

        "12.7th level#H3": {},

        "13.8th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "14.9th level#H3": {},

        "15.10th level#H3": {},

        "16.11th level#H3": {},

        "17.12th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "18.13th level#H3": {},

        "19.14th level#H3": {},

        "20.15th level#H3": {},

        "21.16th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "22.17th level#H3": {},

        "23.18th level#H3": {},

        "24.19th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "25.20th level#H3": {}
    },
    "Warlock#H4": {
        "Level#HIDDEN#RANGE": [1, 20],
        "Proficiency Bonus#HIDDEN#INC": [1, 1, 5, 9, 13, 17],
        "Features#HIDDEN": [
            "Otherworldly Patron, Pact Magic",
            "Eldritch Invocations",
            "Pact Boon",
            "Ability Score Improvement",
            "-",
            "Otherworldly Patron feature",
            "-",
            "Ability Score Improvement",
            "-",
            "Otherworldly Patron feature",
            "Mystic Arcanum (6th level)",
            "Ability Score Improvement",
            "Mystic Arcanum (7th level)",
            "Otherworldly Patron feature",
            "Mystic Arcanum (8th level)",
            "Ability Score Improvement",
            "Mystic Arcanum (9th level)",
            "-",
            "Ability Score Improvement",
            "Eldritch Master"
        ],
        "Cantrips Known#HIDDEN#INC": [1, 1, 4, 10],
        "Spells Known#HIDDEN#INC": [1, 1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 13, 15, 17, 19],
        "Spell slots#HIDDEN#INC": [1, 2, 11, 17],
        "Slot Level#HIDDEN#INC#LOOKUP(_st)": [1, 3, 5, 7, 9],
        "Invocations Known#HIDDEN#INC": [2, 2, 5, 7, 9, 12, 15, 18],
        "1.The Warlock#H3#HR_AFTER#HR_BEFORE#LOOKUP_TABLE(1,20)": [
            "Level", "Proficiency Bonus", "Features", "Cantrips Known", "Spells Known", "Spell slots", "Slot Level", "Invocations Known"
        ],

        "2.Hit Dice#H2#CALL(_hitpoints)": 8,
        "3.Proficiencies#H2": [
            "<BOLD>Armor:</BOLD> Light armor",
            "<BOLD>Weapons:</BOLD> Simple weapons",
            "<BOLD>Tools:</BOLD> None",
            "<BOLD>Saving Throws:</BOLD> WIS and CHA",
            "<BOLD>Skills:</BOLD> Choose two from Arcana, Deception, History, Intimidation, Investigation, Nature, Religion"
        ],
        "4.Starting Equipment or 4d4 x 10 gp#H2": [
            "<LIST_START>",
            "<LIST_ITEM>(a) a light crossbow and 20 bolts or (b) any simple weapon",
            "<LIST_ITEM>(a) a component pouch or (b) an arcane focus",
            "<LIST_ITEM>(a) a scholar's pack or (b) a dungeoneer's pack",
            "<LIST_ITEM>Leather armor, any simple weapon and two daggers",
            "<LIST_STOP>"
        ],
        "5.Multiclassing#H2": [
            "Need CHA of 13 to multiclass in or out",
            "Proficiencies gained: Light armor, simple weapons",
            "Spell slots: If you have Pact Magic and Spellcasting, you can use any spell slots to cast any spells that you know and have prepared. These spell slots should be tracked separately."
        ],

        "6.1st level#H3": {},

        "7.2nd level#H3": {},

        "8.3rd level#H3": {},

        "9.4th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "10.5th level#H3": {},

        "11.6th level#H3": {},

        "12.7th level#H3": {},

        "13.8th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "14.9th level#H3": {},

        "15.10th level#H3": {},

        "16.11th level#H3": {},

        "17.12th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "18.13th level#H3": {},

        "19.14th level#H3": {},

        "20.15th level#H3": {},

        "21.16th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "22.17th level#H3": {},

        "23.18th level#H3": {},

        "24.19th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "25.20th level#H3": {}
    },
    "Wizard#H4": {
        "Level#HIDDEN#RANGE": [1, 20],
        "Proficiency Bonus#HIDDEN#INC": [1, 1, 5, 9, 13, 17],
        "Features#HIDDEN": [
            "Spellcasting, Arcane Recovery",
            "Arcane Tradition",
            "-",
            "Ability Score Improvement",
            "-",
            "Arcane Tradition feature",
            "-",
            "Ability Score Improvement",
            "-",
            "Arcane Tradition feature",
            "-",
            "Ability Score Improvement",
            "-",
            "Arcane Tradition feature",
            "-",
            "Ability Score Improvement",
            "-",
            "Spell Mastery",
            "Ability Score Improvement",
            "Signature Spell"
        ],
        "Cantrips Known#HIDDEN#INC": [1, 1, 1, 4, 10],
        "1st level spell slots#HIDDEN#INC": [1, 1, 2, 3],
        "2nd level spell slots#HIDDEN#INC": [3, 4, 4],
        "3rd level spell slots#HIDDEN#INC": [5, 5, 6],
        "4th level spell slots#HIDDEN#INC": [7, 8, 9],
        "5th level spell slots#HIDDEN#INC": [9, 10, 18],
        "6th level spell slots#HIDDEN#INC": [11, 19],
        "7th level spell slots#HIDDEN#INC": [13, 20],
        "8th level spell slots#HIDDEN#INC": [15],
        "9th level spell slots#HIDDEN#INC": [17],
        "1.The Wizard#H3#HR_AFTER#HR_BEFORE#LOOKUP_TABLE(1,20)": [
            "Level", "Proficiency Bonus", "Features", "Cantrips Known"
        ],

        "2.Hit Dice#H2#CALL(_hitpoints)": 6,
        "3.Proficiencies#H2": [
            "<BOLD>Armor:</BOLD> None",
            "<BOLD>Weapons:</BOLD> Daggers, darts, slings, quarterstaffs, light crossbows",
            "<BOLD>Tools:</BOLD> None",
            "<BOLD>Saving Throws:</BOLD> INT and WIS",
            "<BOLD>Skills:</BOLD> Choose two from Arcana, History, Insight, Investigation, Medicine, Religion"
        ],
        "4.Starting Equipment or 4d4 x 10 gp#H2": [
            "<LIST_START>",
            "<LIST_ITEM>(a) a quarterstaff or (b) a dagger",
            "<LIST_ITEM>(a) a component pouch or (b) an arcane focus",
            "<LIST_ITEM>(a) a scholar's pack or (b) an explorer's pack",
            "<LIST_ITEM>A spellbook",
            "<LIST_STOP>"
        ],
        "5.Multiclassing#H2": [
            "Need INT of 13 to multiclass in or out",
            "Proficiencies gained: None",
            "Spell slots: Add your levels in wizard to the levels from other classes to determine spell slots"
        ],


        "6.1st level#H3": {},

        "7.2nd level#H3": {},

        "8.3rd level#H3": {},

        "9.4th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "10.5th level#H3": {},

        "11.6th level#H3": {},

        "12.7th level#H3": {},

        "13.8th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "14.9th level#H3": {},

        "15.10th level#H3": {},

        "16.11th level#H3": {},

        "17.12th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "18.13th level#H3": {},

        "19.14th level#H3": {},

        "20.15th level#H3": {},

        "21.16th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "22.17th level#H3": {},

        "23.18th level#H3": {},

        "24.19th level#H3": {
            "Ability Score Improvement#H2": "Increase one ability score by 2, or two ability scores by 1. As normal, you cannot increase an ability score above 20 with this feature."
        },

        "25.20th level#H3": {}
    }
}